{"id": 12973, "date": "2025-11-25", "title": "Wednesday 11.26.25", "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/11/25/wednesday-11-26-25.html/", "cycle_info": ["(WK5/8)"], "components": [{"component": "STRENGTH", "details": "Back Squat 3×5 reps Optional Superset: 8-12e x4 Three point DB Rows Note s Perform 4-5 progressive warm-up sets then complete 3 challenging sets of 5 reps. Rest 3-5 minutes between sets. Leave 1–2 reps in reserve each set. If you’d like to add a little more to today, superset with the DB rows, but if you’d rather focus your efforts on the squats or those muscles are sore, skip it."}, {"component": "SKILL: Double Unders", "details": "Notes: Today we’ll do a review on jump rope and Double Under technique. Advanced athletes will have opportunities to attempt max unbroken sets."}]}
{"id": 12972, "date": "2025-11-24", "title": "Tuesday 11.25.25", "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/11/24/tuesday-11-26-25.html/", "cycle_info": ["(WK5/8)"], "components": [{"component": "STRENGTH", "details": "Bench Press 3×1 Reps 70-75% AMRAP x1 Notes Perform 4-5 warm-up sets, then work up through three progressive sets working towards a heavy triple leaving 0-1 rep in reserve. Afterwards, take 70-75% of your best lift and do an AMRAP keeping 0-2 reps in reserve. Aim for 8-12 reps on the AMRAP."}, {"component": "METCON", "details": "Complete for time or max reps in 16:00 30 Burpees 30 Calorie Bike or 36 Row 25 Burpees 25 Calorie Bike or 30 Row 20 Burpees 20 Calorie Bike or 24 Row 15 Burpees 15 Calorie Bike or 18 Row 10 Burpees 10 Calorie Bike or 12 Row 5 Burpees 5 Calorie Bike or 6 Row Notes This workout contains 105 burpees and bike cals, or 126 calories on the erg. The descending rep scheme rewards early intensity but demands consistency as fatigue sets in. This is an aerobic grind — the focus is composure, pacing, and breathing rather than all-out speed. Smooth, consistent effort will yield the best total time."}]}
{"id": 12971, "date": "2025-11-24", "title": "Monday 11.24.25", "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/11/24/monday-11-25-25.html/", "cycle_info": ["(WK5/8)"], "components": [{"component": "ASSISTANCE", "details": "4-5 Rounds for quality and load 8 Left arm Overhead Walking Lunges 8 Right arm Overhead Walking Lunges 16-24 Tuck-Ups or Push-Ups Notes Build up to a top stable weight on the walking lunges. Only go as heavy as your non dominant hand can manage. Choose Tuck-Ups or Push-Ups based on which days you’re coming to the gym. We have bench press and burpees tomorrow."}, {"component": "STRENGTH", "details": "5-8+ Legless Rope Climbs or Mixed Grip Pull-Ups 4×6–12 reps Notes Two options for our pulling strength today. If you have the capacity to perform a legless rope climb use that variation for your training today. Height can be whatever feels reasonable to you, 10′, 15′, 20′. We recommend using a leg wrap on the descent. If legless rope climbs are not possible, perform mixed grip pull-up sets using additional weight, just your body weight or assistance. Alternate which hand is prone and supine each set and attempt to go chest to bar."}]}
