{
  "heroes": [
    {
      "name": "Murph",
      "count": 17,
      "latest_date": "2025-05-25",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/05/25/18th-annual-memorial-day-murph.html/",
      "occurrences": [
        {
          "date": "2025-05-25",
          "title": "18th Annual Memorial Day Murph",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/05/25/18th-annual-memorial-day-murph.html/",
          "summary": "“Murph”: For time: 1-mile run 100 pull-ups 200 push-ups 300 air squats 1-mile run Partition the pull-ups, push-ups, and squats as needed. If you’ve got a 14/20-lb vest or body armor, wear it. Expand to see scaling options Volume Modifications This simply means decreasing the total number of reps or the distance on the run. A common sub would be to do 3/4 of the volume on the calisthenics or 2/3 di"
        },
        {
          "date": "2024-05-27",
          "title": "Monday 5.27.24 Memorial Day Murph",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2024/05/26/monday-5-27-24-memorial-day-murph.html/",
          "summary": "Scaling Options: Volume Modifications This simply means decreasing the total number of reps or the distance on the run. A common sub would be to do 3/4 of the volume on the calisthenics or 2/3 distance on each of the mile runs. You can decrease volume across the board, or only on the movements that you struggle most with. Movement Modifications If any movement is outside of your ability to perform"
        },
        {
          "date": "2023-05-28",
          "title": "Memorial Day Murph 2023",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2023/05/28/memorial-day-murph-2023.html/",
          "summary": "ASSISTANCE: Learn about Memorial Day Murph from CFSBK alumni Noah Abbott. Make a donation to K9s for Warriors to help train service dogs for veterans Enjoy some burgers, hot dogs and whatever sides you all bring with your fellow CFSBKers!"
        },
        {
          "date": "2022-05-29",
          "title": "Memorial Day Murph 2022",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2022/05/29/memorial-day-murph-2022.html/",
          "summary": "“MURPH”: For time: 1 mile Run 100 Pull-ups 200 Push-ups 300 Squats 1 mile Run Notes Over 130 CFSBKers will take on our 15th annual Memorial Day Murph event benefiting K9s for Warriors. We will review some scaling options but try to perform a version that will challenge you and take you about 45-60 minutes. Check out yesterday’s post and the copy below for some ideas. At your heat start time your c"
        },
        {
          "date": "2021-05-31",
          "title": "Memorial Day Murph 2021",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2021/05/31/memorial-day-murph-2021.html/",
          "summary": "Workout: Today over 90 CFSBKers are taking on our 14th annual Memorial Day Murph challenge! This is the first in person “event” we’ve had since last year and are very grateful for finally getting to the point where we can share this holiday with the community again. We’re looking forward to an incredible summer and its been so great to see so many familiar faces coming back to the gym as well. Goo"
        },
        {
          "date": "2020-05-25",
          "title": "Memorial Day Murph",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2020/05/25/wod-5-25-20.html/",
          "summary": "Workout: Virtual Class Zoom Room Password: CFSBK 2020 Virtual ” Memorial Day Murph” AMRAP 20 Minutes: 5e Dumbbell Bent Over Rows 10 Push-Ups 15 Squats Followed by a: 1, 1.5 or 2 mile run Please note that we will only be running one virtual class today at 12pm in observance of our annual Murph Day ( Yoga for Athletes and CrossFit Kids are still happening as scheduled!). After the AMRAP ends, we’ll "
        },
        {
          "date": "2018-05-28",
          "title": "Crush Week: &#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/05/28/murph-2.html/",
          "summary": "“Murph”: For Time: 1 Mile Run 100 Pull-Ups 200 Push-Ups 300 Squats 1 Mile Run In memory of Navy Lieutenant Michael Murphy, 29, of Patchogue, N.Y., who was killed in Afghanistan June 28th, 2005. This workout was one of Mike’s favorites and he’d named it “Body Armor.” It is now referred to as “Murph” in honor of the focused warrior and great American who wanted nothing more in life than to serve thi"
        },
        {
          "date": "2017-05-29",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/05/29/murph.html/",
          "summary": "“Murph”: For time: 1 Mile Run 100 Pull-Ups 200 Push-Ups 300 Squats 1 Mile Run In memory of Navy Lieutenant Michael Murphy, 29, of Patchogue, N.Y., who was killed in Afghanistan June 28th, 2005. This workout was one of Mike’s favorites and he’d named it “Body Armor.” It is now referred to as “ Murph ” in honor of the focused warrior and great American who wanted nothing more in life than to serve t"
        },
        {
          "date": "2016-05-30",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/05/30/2016530murph-html.html/",
          "summary": "“Murph”: For time: 1 Mile Run 100 Pull-Ups 200 Push-Ups 300 Squats 1 Mile Run In memory of Navy Lieutenant Michael Murphy, 29, of Patchogue, N.Y., who was killed in Afghanistan June 28th, 2005. This workout was one of Mike’s favorites and he’d named it “Body Armor.” From here on it will be referred to as “ Murph ” in honor of the focused warrior and great American who wanted nothing more in life t"
        },
        {
          "date": "2015-05-25",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/05/25/2015525murph-html.html/",
          "summary": "Workout: For Time: 1 Mile Run 100 Pull-Ups 200 Push-Ups 300 Squats 1 Mile Run Partition the pull-ups, push-ups, and squats as needed. Start and finish with a mile run. If you’ve got a twenty-pound vest or body armor, wear it. The full version above is a bit too much for most folks. We’ll explain how to scale for volume and movements at the gym. The average times for this workout range from 45 minu"
        },
        {
          "date": "2014-05-26",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/05/26/2014526murph-html.html/",
          "summary": "For time: 1 mile Run 100 Pull-ups 200 Push-ups 300 Squats 1 mile Run: Partition the pull-ups, push-ups, and squats as needed. Start and finish with a mile run. If you’ve got a twenty pound vest or body armor, wear it. The full version above is a bit too much for most folks. We’ll explain how to scale for volume and movements at the gym. The average times for this workout range from 45 minutes to j"
        },
        {
          "date": "2013-05-27",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/05/27/2013527murph-html.html/",
          "summary": "Workout: For time: 1 mile Run 100 Pull-ups 200 Push-ups 300 Squats 1 mile Run Partition the pull-ups, push-ups, and squats as needed. Start and finish with a mile run. If you’ve got a twenty pound vest or body armor, wear it. The full version above is a bit too much for most folks. We’ll explain how to scale for volume and movements at the gym. The average times for this workout range from 45 minu"
        },
        {
          "date": "2012-05-28",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/05/28/2012528murph-html.html/",
          "summary": "Workout: For Time: Run 1 Mile 100 Pull-Ups 200 Push-Ups 300 Squats Run 1 Mile Partition the pull-ups, push-ups, and squats as needed. Start and finish with a mile run. If you’ve got a twenty pound vest or body armor, wear it. There will be a number of movement and scaling options available so whatever your level of fitness is we’ll find the appropriate challenge. In memory of Navy Lieutenant Micha"
        },
        {
          "date": "2011-05-29",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/05/29/2011529murph-html.html/",
          "summary": "Workout: For Time: Run 1 Mile 100 Pull-Ups 200 Push-Ups 300 Squats Run 1 Mile Partition the pull-ups, push-ups, and squats as needed. Start and finish with a mile run. If you've got a twenty pound vest or body armor, wear it. Post time, Rx and experience to comments. compare to 5.31.10 In memory of Navy Lieutenant Michael Murphy, 29, of Patchogue, N.Y., who was killed in Afghanistan June 28th, 200"
        },
        {
          "date": "2010-05-31",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/05/31/2010531murph-html.html/",
          "summary": "Workout: For Time: Run 1 Mile 100 Pull-Ups 200 Push-Ups 300 Squats Run 1 Mile Partition the pull-ups, push-ups, and squats as needed. Start and finish with a mile run. If you've got a twenty pound vest or body armor, wear it. This year's \"Murph\" is dedicated to all the service men and women who have trained and still train at CrossFit South Brooklyn. Who is Murph? Post time and Rx to comments. com"
        },
        {
          "date": "2009-05-31",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/05/31/2009531murph-html.html/",
          "summary": "Workout: 1 Mile Run 100 Pull-ups 200 Push-Ups 300 Squats 1 Mile Run For Time. Partition the pull-ups, push-ups, and squats as needed. Start and finish with a mile run. If you've got a twenty pound vest or body armor, wear it. In memory of Navy Lieutenant Michael Murphy, 29, of Patchogue, N.Y., who was killed in Afghanistan June 28th, 2005. This workout was one of Mike's favorites and he'd named it"
        },
        {
          "date": "2008-05-26",
          "title": "&#8220;Murph&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/05/26/2008526murph-html.html/",
          "summary": "Workout: 1 mile Run 100 Pull-ups 200 Push-ups 300 Squats 1 mile Run Post time to comments. Please be ready to start the WOD at 2:30pm. We will be meeting AT the playground, check the previous post for more details regarding location. There is an entrance to the park at 9th street. If you've got any questions don't hesitate to call me at 973.610.3628 Also, there are NO CLASSES AT THE LYCEUM TONIGHT"
        }
      ]
    },
    {
      "name": "Morrison",
      "count": 9,
      "latest_date": "2019-07-20",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2019/07/19/wod-7-20-19.html/",
      "occurrences": [
        {
          "date": "2019-07-20",
          "title": "WOD 7.20.19",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2019/07/19/wod-7-20-19.html/",
          "summary": "Partner Double “ Morrison “: In teams of 2 with one partner working at a time, complete the following for time: 100-80-60-40-20 Wall Balls 20/10, 14/9 Box Jumps 24/20″ Kettlebell Swings 24/16kg Partition the work however desired with the goal to keep moving. The Kettlebell Swings are Rx’d as overhead. Post time, Rx, and partner to comments. The water goes in your mouth , David! | A classic photo b"
        },
        {
          "date": "2017-11-18",
          "title": "Crush Week: Partner Double &#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/11/18/crush-week-partner-double-morrison-2.html/",
          "summary": "Partner “Morrison”: In teams of 2 with one partner working at a time, complete the following for time: 100-80-60-40-20 Wall Balls 20/10, 14/9 Box Jumps 24/20″ Kettlebell Swings 24/16kg Partition the work however desired. Post time, Rx, and partner to comments. Compare with 4.23.17 and 6.28.17 | CFSBK’s Fourth Art Show is TONIGHT: CFSBK’s fourth Art Show is TONIGHT from 7-10pm . Free entry and alco"
        },
        {
          "date": "2017-06-28",
          "title": "Crush Week: &#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/06/28/crush-week-morrison-2.html/",
          "summary": "“Morrison”: For Time: 50-40-30-20-10 Wall Balls 20/10, 14/9 Box Jumps 24/20 American Kettlebell Swings 24/16kg There is a lot of volume in this Hero Workout, so scale appropriately. If you can do the prescribed weight/height then go for it. Otherwise, scale the weight/height as needed. The volume scale is: 40-30-20-10 This cuts the volume by a third, and is a hell of a workout in its own right. Po"
        },
        {
          "date": "2017-04-23",
          "title": "Crush Week: Partner Double &#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/04/23/crush-week-partner-double-morrison.html/",
          "summary": "Partner Double “Morrison”: In teams of 2, with one partner working at a time, complete the following for time: 100-80-60-40-20 Wall Balls 20/10, 14/9 Box Jumps 24/20″ Kettlebell Swings 24/16kg Partition the work however desired. Post time, Rx, and partner to comments. How was your Crush Week? What was the toughest workout? Tell us in the comments! | Today’s Schedule: We’re hosting the Starting Str"
        },
        {
          "date": "2016-12-14",
          "title": "Crush Week: &#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/14/crush-week-morrison.html/",
          "summary": "“Morrison”: For Time: 50-40-30-20-10 Wall Balls 20/10, 14/9 Box Jumps 24/20 American Kettlebell Swings 24/16 There is a lot of volume in this Hero WOD , so scale appropriately. If you can do it Rx’d, then go for it, otherwise scale the weight/height. The volume scale is: 40-30-20-10 This cuts the volume by a third and is a hell of a workout in its own right. Post time and Rx to comments. Compare w"
        },
        {
          "date": "2016-02-08",
          "title": "&#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/02/08/201628morrison-html.html/",
          "summary": "“Morrison”: 50-40-30-20 and 10 rep rounds of: Wall Ball 20/14 to a 10′ Target Box jump 24/20″ (jump is Rx’d, step-up is scaled) Kettlebell Swing, 53/35 *40 minute cap As Rx’d, “Morrison” is 450 total reps (that’s a lot!) and is often reported as one of the hardest WODs people have done. Set a steady pace for yourself and try to stick to it. Definitely don’t blow up in the 50s. B Scale: 40-30-20-10"
        },
        {
          "date": "2014-04-05",
          "title": "&#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/04/05/201445morrison-html.html/",
          "summary": "Workout: 50-40-30-20 and 10 Rep Rounds Of: Wall Ball Shots, 20/14 10′ Box Jumps, 24″/20″ Kettlebell Swings 1.5p/1p B Scale: 40-30-20-10 reps for time C Scale: Partner Morrison There is a 40 minute cap on this workout U.S. Army Specialist Scott Morrison, 23, of Blue Ash, Ohio, assigned to 584th Mobility Augmentation Company, 20th Engineer Battalion, 36th Engineer Brigade, based out of Fort Hood, Te"
        },
        {
          "date": "2012-05-23",
          "title": "&#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/05/23/2012523morrison-html.html/",
          "summary": "Workout: 50-40-30-20 and 10 Rep Rounds Of: Wall Ball Shots, 20/14 10′ Box Jumps, 24″/20″ Kettlebell Swings 1.5p/1p B Scale: 40-30-20-10 reps for time C Scale: 30-20-10 reps for time or NFT There is a 30 minute cap on this workout U.S. Army Specialist Scott Morrison, 23, of Blue Ash, Ohio, assigned to 584th Mobility Augmentation Company, 20th Engineer Battalion, 36th Engineer Brigade, based out of "
        },
        {
          "date": "2011-07-13",
          "title": "&#8220;Morrison&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/07/13/2011713morrison-html.html/",
          "summary": "Workout: 50-40-30-20 and 10 Rep Rounds Of: Wall Ball Shots, 20/14 10′ Box Jumps, 24″/20″ Kettlebell Swings 1.5p/1p B Scale: 40-30-20-10 reps for time C Scale: 30-20-10 reps for time or NFT There is a 30 minute cap on this workout U.S. Army Specialist Scott Morrison, 23, of Blue Ash, Ohio, assigned to 584th Mobility Augmentation Company, 20th Engineer Battalion, 36th Engineer Brigade, based out of "
        }
      ]
    },
    {
      "name": "Dt",
      "count": 7,
      "latest_date": "2018-09-22",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/09/22/wod-9-22-18.html/",
      "occurrences": [
        {
          "date": "2018-09-22",
          "title": "WOD 9.22.18",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/09/22/wod-9-22-18.html/",
          "summary": "Partner “DT on the Run”: For Time: 400m Run 120 Deadlifts 155/105 400m Run 90 Hang Power Cleans 155/105 400m Run 60 Push Jerks 155/105 400m Run Partners complete the runs together and break up the barbell however desired. Use one barbell for the whole workout. The loading on this running partner riff on the classic CrossFit benchmark “DT” should be a challenging for the total amount of work, but t"
        },
        {
          "date": "2018-08-02",
          "title": "Crush Week: &#8220;DT&#8221; in a Boat",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/08/02/crush-week-dt-in-a-boat.html/",
          "summary": "“DT” in a Boat: 3 Rounds for Time: 500m Row 2 Rounds of “DT” 155/105 “DT”= 12 Deadlifts + 9 Hang Power Cleans + 6 Push Jerks The limiting factor determining load on the barbell will likely be the Jerks, which should be medium-heavy for you. Scale load as needed so that most sets of jerks can be done unbroken. Each round of “DT” should take around a minute, so considering scaling volume overall to "
        },
        {
          "date": "2014-07-23",
          "title": "&#8220;DT&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/07/23/2014723dt-html.html/",
          "summary": "“ DT “: 5 Rounds for Time: 12 Deadlift 155/105 9 Hang Power Clean 6 Jerks Post time and Rx to comments. SBK goes west and hits San Francisco CrossFit | News and Notes: CSA Pickup Today, PLUS Eggs for Sale : Vegetable, flower and egg CSA pickup is today, 6-8:30pm . Look for Asta with the clipboard to pick up your goodies. Also, Herondale eggs for sale by the dozen for $6; please bring small bills. "
        },
        {
          "date": "2012-12-03",
          "title": "&#8220;DT&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/12/03/2012123dt-html.html/",
          "summary": "Workout: Five rounds for time of: 12 Deadlift 155/105 9 Hang Power Clean 155/105 6 Push Jerk 155/105 Post Rx and time to comments. compare to 12.25.11 Remember, “DT” as Rx’d is now on the CFSBK leader boards! See Jason Khalipa do this in 6:18 In honor of USAF SSgt Timothy P. Davis, 28, who was killed on Feburary, 20 2009 supporting operations in OEF when his vehicle was struck by an IED. Timothy i"
        },
        {
          "date": "2011-12-25",
          "title": "DT",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/12/25/20111225dt-html.html/",
          "summary": "Workout: Five rounds for time of: 12 Deadlift 155/105 9 Hang Power Clean 155/105 6 Push Jerk 155/105 There is a 20 minute cap on this WOD Rob N. in a Very CrossFit Christmas Card"
        },
        {
          "date": "2011-05-26",
          "title": "&#8220;DT&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/05/26/2011526dt-html.html/",
          "summary": "Workout: Five Rounds For Time of: 12 Deadlifts 9 Hang Power Cleans 6 Push Jerks Rx Loads are 155/95 Post time and Rx to comments. compare to 4.18.09 Congratulations to Sean B for being Selected for Special Forces Assessment and Selection (SFAS). This is a grueling 2 week test that only about 1/3 of the candidates pass. Sean will now begin a year and a half of Special Forces training. To see a vide"
        },
        {
          "date": "2009-04-18",
          "title": "&#8220;DT&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/04/18/2009418dt-html.html/",
          "summary": "Workout: Five rounds for time of: 155 pound Deadlift, 12 reps 155 pound Hang power clean, 9 reps 155 pound Push jerk, 6 reps We're going to try and do this one outside today. Post time to comments. Accessory Work Barbell Warm-ups Deb gets inverted There is no Teaser Class today If you'd like to volunteer at the North East Coast Regional Qualifier, please send an email to David@CrossFitSouthBrookly"
        }
      ]
    },
    {
      "name": "Jerry",
      "count": 7,
      "latest_date": "2018-09-29",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/09/29/jerry.html/",
      "occurrences": [
        {
          "date": "2018-09-29",
          "title": "&#8220;Jerry&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/09/29/jerry.html/",
          "summary": "“Jerry”: For Time: 1 Mile Run 2K Row 1 Mile Run This benchmark hero workout and CFSBK Leaderboard item, “Jerry” (aka “The CrossFit 5K”), isn’t meant to be a relaxing jog/row sandwich. Set a goal to run a hard first mile, maintain an uncomfortable pace for the row, and empty the tank on the final mile. If you’re newer to CrossFit or your mile pace is greater than 10 minutes consider scaling to 2/3 "
        },
        {
          "date": "2017-09-14",
          "title": "Clean | Half &#8220;Jerry&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/09/14/clean-half-jerry.html/",
          "summary": "Clean Complex: Every Minute on the Minute x 15: 1-7: 2 Tall Cleans 8-15: 2 Hip Cleans Post loads to comments. Exposure 1 of 8 _____________________ | Half “Jerry”: For Time: 800m Run 1000m Row 800m Row Try to stay uncomfortable on this one today. Post time and Rx to comments. Throwback Thursday: Team CFSBK, uh, flexing at last year’s Flex on the Beach . A bunch more CFSBKers will be competing at F"
        },
        {
          "date": "2016-08-13",
          "title": "Crush Week | &#8220;Jerry&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/08/13/2016813crush-week-jerry-html.html/",
          "summary": "“Jerry”: For Time: Run 1 Mile Row 2k Run 1 Mile Post time and Rx to comments. Cute moments in VooDoo Flossing with Greg A. and Maggie S. | Photo by Thomas H. | TOMORROW: The 2016 NYC Subway Series at CrossFit Gantry: Another year has gone by, and it’s time once again for an NYC affiliate throwdown: the sixth annual Subway Series ! All NYC affiliates are invited to participate—the affiliate with th"
        },
        {
          "date": "2015-06-03",
          "title": "&#8220;Jerry&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/06/03/201563jerry-html.html/",
          "summary": "“Jerry”: For Time: Run 1 Mile Row 2000m Run 1 Mile Post time to comments. Compare to 4.14.2012 Want to learn more about our CrossFit Preschool and CrossFit Kids programs? Info about these programs now lives on our Programs and Membership Options page here . The mission of both programs is to emphasize good movement through games and activities. Developing a positive association between fitness, ph"
        },
        {
          "date": "2012-04-14",
          "title": "&#8220;Jerry&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/04/14/2012414jerry-html.html/",
          "summary": "Workout: For Time: Run 1 Mile Row 2000m Run 1 Mile Post time to comments. Eric Siegel Does Jery in 22:19 WOD Demo with CrossFit Rubicon Ken Haller There is No Active Recovery today while David is in Holland"
        },
        {
          "date": "2011-06-19",
          "title": "&#8220;Jerry&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/06/19/2011619jerry-html.html/",
          "summary": "Workout: For time: Run 1 Mile Row 2K Run 1 Mile Post total time and three splits to comments. Compare to 10.10.10 They're coming to get you! Happy Father's Day We are incredibly proud of having so many families train at our box. We want to wish all of the great dads in our community a Happy Father's Day!! ___________________ The athletic 'Bucket List': What sport/activity/event have you never trie"
        },
        {
          "date": "2010-10-10",
          "title": "&#8220;Jerry&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/10/10/20101010jerry-html.html/",
          "summary": "Workout: For time: Run 1 Mile Row 2K Run 1 Mile Post total time and three splits to comments. Read Coach Nick's article on Rowing a 2K 22:19 \"Jerry\" Demo The great Carlos G!"
        }
      ]
    },
    {
      "name": "Nate",
      "count": 7,
      "latest_date": "2024-06-22",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2024/06/21/saturday-6-22-24.html/",
      "occurrences": [
        {
          "date": "2024-06-22",
          "title": "Saturday 6.22.24",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2024/06/21/saturday-6-22-24.html/",
          "summary": "PARTNER METCON: “NATE”: AMRAP 20 MIN 2 Ring Muscle Ups 4 Handstand Push Ups 8 KB Swings @ 32/24/16kg Notes Chief Petty Officer Nate Hardy was killed Sunday February 4th, 2008, during combat operations in Iraq. Nate is survived by his wife, Mindi, and his son Parker. Usually a solo workout, today we will complete this in teams of 2, chipping away movement by movement. Partner A completes the muscle"
        },
        {
          "date": "2017-04-19",
          "title": "Crush Week: &#8220;Nate&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/04/19/crush-week-nate.html/",
          "summary": "“Nate”: Performance AMRAP 20 Minutes: 2 Ring Muscle-Ups 4 Handstand Push-Ups 8 American Kettlebell Swings 32/24kg Jumping Muscle-Ups are an acceptable sub if you have a few Ring Dips and stability in the catch on the rings. Scale range of motion to up to 2 AbMats and load on the kettlebell as needed. Fitness AMRAP 20 Minutes: 10 Pull-Ups 15 Push-Ups 20 Kettlebell Swings Scale the Pull-Ups to Jumpi"
        },
        {
          "date": "2015-10-10",
          "title": "&#8220;Nate&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/10/10/20151010nate-html.html/",
          "summary": "“ Nate ”: AMRAP 20 Minutes: 2 Muscle-Ups 4 Handstand Push-Ups 8 Kettlebell Swings 72/53# If you can perform the muscle ups and handstand push ups but do not have mastery of them yet then consider scaling volume and/or doing a partner version and splitting all of the work as needed. In honor of Chief Petty Officer Nate Hardy, who was killed on February 4th, 2008 during combat operations in Iraq. Na"
        },
        {
          "date": "2013-10-31",
          "title": "Cindy or Nate",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/10/31/20131031cindy-or-nate-html.html/",
          "summary": "Cindy: As Many Rounds As Possible In 20 Minutes Of: 5 Pull Ups or Ring Rows 10 Push Ups 15 Squats | Nate: As Many Rounds As Possible In 20 Minutes Of: 2 Muscle-Ups 4 Handstand Push-Ups 8 Kettlebell Swings, 32/24kg Fitness Rx is Cindy and Performance is Nate. “ Nate” Demo with Eva T Post rounds completed and RX to comments. Happy Halloween!!! Happy Birthday, Alan C ! Check out CFSBKer, Actor and Ph"
        },
        {
          "date": "2011-10-19",
          "title": "&#8220;Nate&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/10/19/20111019nate-html.html/",
          "summary": "Workout: As Many Rounds As Possible in 20 Minutes of: 2 Muscle-Ups 4 Handstand Push-Ups 8 Kettlebell Swings, 32/24 kg In honor of Chief Petty Officer Nate Hardy, who was killed February 4th, 2008 during combat operations in Iraq. Nate is survived by his wife, Mindi, and his son Parker Workout Demo with Eva T Post rounds and Rx to comments. compare to 10.20.10 Self Defense at CFSBK Poster, Click to"
        },
        {
          "date": "2010-10-21",
          "title": "&#8220;Nate&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/10/21/20101021nate-html.html/",
          "summary": "Workout: Complete as many rounds in twenty minutes as you can of: 2 Muscle-ups 4 Handstand Push-ups 8 2-Pood Kettlebell swings Post rounds completed to comments. compare to 10.2.08 (HSPU E2/4) Eva T does \"Nate\" CrossFit.com 310lbs: OWNED On February 5th and 6th CFSBK will be hosting MobilityWOD posterboy Kelly Starrett for the CrossFit Mobility Certification. Once registration goes live we'll post"
        },
        {
          "date": "2008-10-02",
          "title": "&#8220;Nate&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/10/02/2008102nate-html.html/",
          "summary": "Workout: Complete as many rounds in twenty minutes as you can of: 2 Muscle-ups 4 Handstand Push-ups 8 2-Pood Kettlebell swings Post rounds completed to comments. Accessory work Mobility Drills Steve Burton Daniel Photography at CFSBK Some classic journalism for the newbies: God's Workout New York Times Getting Fit, Even if it Kills You New York Times High School Girls' Weightlifting New York Time "
        }
      ]
    },
    {
      "name": "Nick",
      "count": 4,
      "latest_date": "2016-11-12",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/11/12/20161112front-squat-wod-111216-html.html/",
      "occurrences": [
        {
          "date": "2016-11-12",
          "title": "Front Squat | WOD 11.12.16",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/11/12/20161112front-squat-wod-111216-html.html/",
          "summary": "Front Squat: Fitness 3 x 5 Warm up and perform 3×5 at 95% of your heavy 5 from Week 1 . Performance 5/3/1 (5 Week): 65% x 5 75% x 5 85% x 5+ Your Training Max (TM) is used to base the percentages off of. Increase your TM 10 lbs above the previous 3 weeks. If you were above the recommended reps for the rep out sets, then increase your TM 15-20 lbs. The final set (the 85% set this week) is done for "
        },
        {
          "date": "2015-10-21",
          "title": "Back Squat | &#8220;Amanda&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/10/21/20151021back-squat-amanda-html.html/",
          "summary": "Back Squat: Performance : Medium Intensity, 75-80% x 5 x 4 Fitness : 3 x 8 Linear Progression Heavier than last week. Exposure 2/8 Post loads to comments. _____________________ Performance | “Amanda”: 9-7-5 Reps for Time: Muscle-Ups Snatches 135/95 Rx for the snatch is a full squat. If it’s caught high there cannot be a discernible pause before riding to the bottom of a squat. Scaling to power sna"
        },
        {
          "date": "2012-02-02",
          "title": "Press",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/02/02/201222press-html.html/",
          "summary": "70%x3 80%x3 90%x3+: Novice lifters will continue their linear progressions adding 5-10lbs as appropriate. Post loads to comments. compare to 1.26.12 or 1.11.12 As Many Rounds as Possible in 10 Minutes of: 7 Toes to Bar 21 Double Unders Post rounds completed and Rx to comments. Neal G, 71 years young, pulls 245×3 for sets across last Tuesday. Go Neal! Happy Birthday Chris A. and Nate O! Check out o"
        },
        {
          "date": "2012-01-15",
          "title": "Clean",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/01/15/2012115clean-html.html/",
          "summary": "Work up to a heavy single: Post loads to comments. 15-9-6 Reps For Time of: Hang Squat Clean Burpee There is a 10 Minute Cap on this workout Post rounds completes and Rx to comments. Long Live the Ring Row! | Why Do I Feel Funny? (On Paleo): By Margie Lempert (Orginally Posted on 1.7.11) It’s a little over one week into the Paleo Challenge, you’ve done at least one big shopping trip, you’re gettin"
        }
      ]
    },
    {
      "name": "Danny",
      "count": 3,
      "latest_date": "2018-08-25",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/08/25/handstand-work-danny.html/",
      "occurrences": [
        {
          "date": "2018-08-25",
          "title": "Handstand Work | &#8220;Danny&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/08/25/handstand-work-danny.html/",
          "summary": "Freestanding Hand Balancing Practice: Work against a wall or with a spotter on one or a few of the options below: A) Handstand Hold from a Wall Walk B) Handstand Hold from a Kick-Up C) Second Handstand Hold to a Spotter D) Freestanding Handstand Hold Choose a level that allows you to hold a good position for 10-40 seconds, working back and forth with a partner or two to allow for rest between sets"
        },
        {
          "date": "2015-08-09",
          "title": "&#8220;Danny&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/08/09/201589danny-html.html/",
          "summary": "“ Danny “: AMRAP 20 minutes: 30 Box Jumps 24/20 20 Push Presses 115/75 30 Pull-Ups Scale load and volume as appropriate, but this should be a bit of a slog. If you can jump on the Rx’d box and do 5 reps at a time of the Rx’d push press and pull-ups, then Rx today. If not, scale some volume and or load and pull-up variant. Post rounds and Rx to comments. Compare to 2.2.2011 Check out Episode 2 of C"
        },
        {
          "date": "2011-02-03",
          "title": "&#8220;Danny&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/02/03/201123danny-html.html/",
          "summary": "Workout: AMRAP 20 Minutes 30 Box Jumps 24/20 20 Push Press 115/80 30 Pull-Ups Post Rounds and Rx to comments. Going Up. Who Was Danny? Oakland SWAT Sergeant Daniel Sakai, age 35, was killed on March 21, 2009 in the line of duty along with fellow officers Sergeant Ervin Romans, Sergeant Mark Dunakin, and Officer John Hege. Daniel is survived by wife Jenni and daughter Jojiye. Via Crossfit.com _____"
        }
      ]
    },
    {
      "name": "Holleyman",
      "count": 2,
      "latest_date": "2024-05-11",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2024/05/10/saturday-5-11-24.html/",
      "occurrences": [
        {
          "date": "2024-05-11",
          "title": "Saturday 5.11.24",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2024/05/10/saturday-5-11-24.html/",
          "summary": "Partner “Holleyman”: AMRAP 30:00 5 Wall Ball Shots (20/14 lb) 3 Handstand Push-Ups 1 Power Clean (225/155 lb) Notes Today is a partner version of a classic CrossFit hero workout “Holleyman”. Partners will alternate complete rounds for 30 minutes. Get after it today! U.S. Army Staff Sergeant Aaron N. Holleyman , 27, of Glasgow, Montana, assigned to the 1st Battalion, 5th Special Forces Group, based"
        },
        {
          "date": "2017-09-10",
          "title": "Crush Week: &#8220;Holleyman&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/09/10/crush-week-holleyman.html/",
          "summary": "“Holleyman”: 30 Rounds for Time of: 5 Wall Ball Shots 20/10, 14/9 3 Handstand Push-Ups 1 Power Clean 225/155 This is a doozy of a workout that, for most, packs a serious strength training component as well. The short rep scheme makes this workout doable for many, but scale as appropriate. The Wall Balls should be done unbroken, as should the Handstand Push-Ups. Scale load/height on the Wall Balls "
        }
      ]
    },
    {
      "name": "Randy",
      "count": 2,
      "latest_date": "2016-10-16",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/10/16/20161016crush-week-randy-html.html/",
      "occurrences": [
        {
          "date": "2016-10-16",
          "title": "Crush Week: &#8220;Randy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/10/16/20161016crush-week-randy-html.html/",
          "summary": "“Randy”: For Time: 75 Power Snatches 75/55 These should be on the very light side for you today. 40-60% is appropriate. It should be a weight that you can perform (initially at least) sets of 5-15 reps of. Fastest time are a little over 2 minutes (and performed unbroken!), but we’ll have a soft 10 minute cap on this hero WOD today. Even though the Power Snatches are light, it’s 75 reps and most pe"
        },
        {
          "date": "2008-05-05",
          "title": "&#8220;Randy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/05/05/200855randy-html.html/",
          "summary": "Workout: For Time: 75 Power Snatches Beginner’s Class: Overhead Squat 3-3-3-3-3 Mini “Cindy” Post Loads and Rounds To Comments 31 Tomorrow Snatch Power Snatch Hang Power Snatch"
        }
      ]
    },
    {
      "name": "Griff",
      "count": 1,
      "latest_date": "2008-08-03",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/08/03/200883griff-html.html/",
      "occurrences": [
        {
          "date": "2008-08-03",
          "title": "&#8220;Griff&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/08/03/200883griff-html.html/",
          "summary": "Workout: For time: Run 800 meters Run 400 meters backwards Run 800 meters Run 400 meters backwards Post time to comments. Shane flips a big f$$ing tire. How to flip a big f$$ing tire."
        }
      ]
    },
    {
      "name": "Jt",
      "count": 1,
      "latest_date": "2025-09-09",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/09/08/tuesday-9-9-25.html/",
      "occurrences": [
        {
          "date": "2025-09-09",
          "title": "Tuesday 9.9.25",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/09/08/tuesday-9-9-25.html/",
          "summary": "SKILL: Handstand kick ups and Holds Notes Today is all about building confidence and control upside down. Use the time to practice smooth kick-ups and strong, active handstand holds. Keep the focus on technique and body position. When kicking up, start small and controlled, then build height as you feel more confident. Think about stacking your hips over your shoulders and pressing the floor away "
        }
      ]
    },
    {
      "name": "Ryan",
      "count": 1,
      "latest_date": "2008-10-09",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/10/09/2008109ryan-html.html/",
      "occurrences": [
        {
          "date": "2008-10-09",
          "title": "&#8220;Ryan&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/10/09/2008109ryan-html.html/",
          "summary": "Workout: Five rounds for time of: 7 Muscle-ups 21 Burpees Each burpee terminates with a jump one foot above max standing reach. Post time to comments. Accessory work: Foam Roll 500m technique row x2 This workout is in honor of Maplewood, Missouri Firefighter, Ryan Hummert, 22, who was killed by sniper fire July 21st 2008 when he stepped off his fire truck responding to a call. He is survived by hi"
        }
      ]
    }
  ],
  "girls": [
    {
      "name": "Cindy",
      "count": 21,
      "latest_date": "2019-08-17",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2019/08/16/wod-8-17-19.html/",
      "occurrences": [
        {
          "date": "2019-08-17",
          "title": "WOD 8.17.19",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2019/08/16/wod-8-17-19.html/",
          "summary": "Partner “Cindy” + Row/Bike: AMRAP 15 Minutes: 5 Pull-Ups 10 Push-Ups 15 Squats Partners alternate complete rounds. Modify the Pull-ups to ring rows and the push ups to knee push ups as needed. Rest 5 minutes, then… In 15 Minutes: Max Distance Row/Bike Partners alternate as desired. Post work and partner to comments. | Tomorrow: Iron Maidens Lift & Learn Session: Sunday, August 18, 2019 from 2:00 t"
        },
        {
          "date": "2019-04-06",
          "title": "WOD 4.6.19",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2019/04/05/wod-4-6-19.html/",
          "summary": "Partner Cindy: AMRAP 30 Minutes: 5 Pull-Ups 10 Push-Ups 15 Squats Partners alternate full rounds. Post rounds, reps, Rx, and partne to comments. Week 2 of 8 View this post on Instagram A post shared by CrossFit South Brooklyn (@crossfitsouthbrooklyn) on Apr 5, 2019 at 12:05pm PDT The Dead Boys, Joshy G. and WWE’s Seth Rollins , getting in a synchro partner workout in before today’s Day with the De"
        },
        {
          "date": "2018-07-30",
          "title": "Crush Week: &#8220;Run, Cindy, Run!",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/07/30/crush-week-run-cindy-run.html/",
          "summary": "“Run, Cindy, Run!”: 3 Rounds for Time: 800m Run 5 Rounds of “Cindy” Cindy = 5 Pull-Ups + 10 Push-Ups + 15 Squats Scale the runs to 550m as needed of you can’t complete the 800s under 5 minutes. Scaling for Pull-Ups is Ring Rows or Jumping Pull-Ups, and Push-Ups is Knee Push-Ups. The “Cind”y rounds should take about a minute. Scale volume to 3-4 rounds per set if you want to work on a more challeng"
        },
        {
          "date": "2016-12-12",
          "title": "Crush Week: &#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/12/crush-week-cindy.html/",
          "summary": "“Cindy”: AMRAP 20 Minutes: 5 Pull-Ups 10 Push-Ups 15 Squats Aim to move quickly from station to station on this throwback benchmark and CFSBK Leaderboard WOD. In it’s best capacity, the movements are performed unbroken throughout, though most athletes will break up at least the Push-Ups and the Pull-Ups as needed. Scale the Pull-Ups to bands or ring rows as needed, or scale some volume. Scale the "
        },
        {
          "date": "2016-03-23",
          "title": "Bench Press | &#8220;Cindy Row Your Boat&#8221; (LFPB Capacity Test)",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/03/23/2016323bench-press-cindy-row-your-boat-lfpb-capacity-test-html.html/",
          "summary": "Bench Press: Performance Bench Press 1-1-1 @ 85%+ Warm up and make 3 singles at 85% or better of your 1RM. If it’s feeling great, then go for a new 1RM. If not, hang back a bit and make three heavy reps. Fitness Bench Press 5-5-5 Find a heavy 5-rep Bench Press. You should feel like you can do 2-3 more at your heaviest weight. No failing. Post loads to comments. _____________________ | “Cindy Row Y"
        },
        {
          "date": "2016-02-24",
          "title": "Deadlift | &#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/02/24/2016224deadlift-cindy-html.html/",
          "summary": "Deadlift: 3-3-3-3-3 Work up to a max triple for the day. No failing, no loss of position. Touch-and-Go is permitted. Post loads to comments. __________________ | “Cindy”: AMRAP 20 Minutes: 5 Pull-Ups 10 Push-Ups 15 Squats In its best form, this classic triplet is performed unbroken with stamina/cardiovascular capacity being the limiter. For most, it’s either Pull-Up and/or Push-Up capacity that sl"
        },
        {
          "date": "2015-06-27",
          "title": "Front Squat | &#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/06/27/2015627front-squat-cindy-html.html/",
          "summary": "Workout: Fitness : 3 x 3 Linear Progression Add 5-10 pounds to last week’s exposure. Performance : 3 x 3 Linear Progression Add 5-10 pounds to last week’s exposure. Post loads to comments. e3/8 _____________________"
        },
        {
          "date": "2014-06-26",
          "title": "&#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/06/26/2014626cindy-html.html/",
          "summary": "“Cindy”: AMRAP 20 minutes: 5 Pull Ups 10 Push Ups 15 Squats Compare to 10.31.2013. Post Rx and rounds to comments. 15 Minutes Not For Time: 5 Turkish Get Up Left 5 Turkish Get Up Right 300m Row Post loads to comments. | Throwback Thursday: On this day in 2009 , the following people graduated from Foundations: Julie E. , Lisa M. , Ben W ., Ariel K. , Samir C ., Joe W. , Cloyde M. , Samantha H. , an"
        },
        {
          "date": "2013-10-31",
          "title": "Cindy or Nate",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/10/31/20131031cindy-or-nate-html.html/",
          "summary": "Cindy: As Many Rounds As Possible In 20 Minutes Of: 5 Pull Ups or Ring Rows 10 Push Ups 15 Squats | Nate: As Many Rounds As Possible In 20 Minutes Of: 2 Muscle-Ups 4 Handstand Push-Ups 8 Kettlebell Swings, 32/24kg Fitness Rx is Cindy and Performance is Nate. “ Nate” Demo with Eva T Post rounds completed and RX to comments. Happy Halloween!!! Happy Birthday, Alan C ! Check out CFSBKer, Actor and Ph"
        },
        {
          "date": "2012-11-18",
          "title": "&#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/11/18/20121118cindy-1-html.html/",
          "summary": "Workout: As Many Rounds As Possible In 20 Minutes Of: 5 Kipping Pull-Ups 10 Push-Ups 15 Squats Post rounds and Rx to comments. compare to 5.6.12 Thanks to all who came out to CFSBK’s Double Feature Movie Night Last Night!"
        },
        {
          "date": "2012-05-06",
          "title": "&#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/05/06/201256cindy-html.html/",
          "summary": "Workout: As Many Rounds As Possible In 20 Minutes of: 5 Pull-Ups 10 Push-Ups 15 Squats Post rounds and Rx to comments. compare to 1.8.12 Happy Birthday Coach Jeremy!"
        },
        {
          "date": "2012-01-08",
          "title": "&#8220;Cindy&#8221; or &#8220;Mary&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/01/08/201218cindy-or-mary-html.html/",
          "summary": "“Mary” AMRAP 20 minutes 5 Handstand Push-ups 10 One legged squats, alternating 15 Pull-ups: Post workout, rounds completed and Rx to comments. compare to 1.29.11 “Cindy… Or Mary??” … “YOU DECIDE” | Rest Day Dinner #2: Overview: Attention all Bed Stuy/Clinton Hill (and beyond!) CrossFitters. Melissa Lloyd is hosting the second Rest Day Dinner of the 2012 Paleo Challenge in your hood. This will be a"
        },
        {
          "date": "2011-11-07",
          "title": "Bottomless Cindy",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/11/07/2011117bottomless-cindy-html.html/",
          "summary": "Workout: As Many Rounds As Possible in 20 minutes of: 5 Pull Ups 10 Push Ups 15 Double Unders* *Athletes can sub Lateral Hops for DUs. There is a mandatory 7 minutes of Double Under practice for subbing in the lateral hops.﻿ Post rounds and RX to comments. John S. Hits Depth During the Total"
        },
        {
          "date": "2011-04-30",
          "title": "&#8220;Partner Cindy Around the Block&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/04/30/2011430partner-cindy-around-the-block-html.html/",
          "summary": "Workout: Partners A and B have 20 minutes to do \"Cindy\" plus runs around the block. Partner A begins on Cindy while Partner B runs around the block. As soon as Partner B returns, he/she picks up exactly where Partner A left off while Partner A runs around the block. Continue to alternate Cindy with runs, both partners accumulating Cindy rounds together. Focus on perfect technique with every single"
        },
        {
          "date": "2011-01-30",
          "title": "&#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/01/30/2011130cindy-html.html/",
          "summary": "Workout: As Many Rounds as Possible in 20 Minutes of: 5 Pull-Ups 10 Push-Ups 15 Squats Post Rx and rounds to comments. compare to 3.7.10 Teresa B warms up for a Heavy Single CFSBK Group Class Programming Notes Starting today, we'll be programming a \"Crush Week\" of WODs before starting the back off week on Saturday the 5th. Our normal cycle of programming will continue on 2/12. Here it is all spell"
        },
        {
          "date": "2010-12-20",
          "title": "&#8220;Partner Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/12/20/20101220partner-cindy-html.html/",
          "summary": "Workout: As many collective rounds as possible in 24 minutes of: 5 Pull-ups 10 Push-Ups 15 Squats Partners will alternate 2 minute intervals of one partner working while the other rests. The rep count will pick up where your partner leaves off. Post Partner, Rx and work completed to comments. \"Mini-Cindy\" WOD Demo CrossFit Ariel's 210lb Deadlift PR at the Total CFSBK Holiday Schedule Friday the 24"
        },
        {
          "date": "2010-09-19",
          "title": "&#8220;Hanging with Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/09/19/2010919hanging-with-cindy-html.html/",
          "summary": "Workout: Complete as many rounds as possible in 20 minutes of: 3 Hang Power Cleans 135/95 5 Pull Ups 10 Push Ups 15 Squats Post rounds and Rx to comments. Charmel R, Live at CFSBK!"
        },
        {
          "date": "2010-03-07",
          "title": "&#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/03/07/201037cindy-html.html/",
          "summary": "Workout: As many rounds as possible in 20 minutes of: 5 Pull-ups 10 Push-Ups 15 Squats Post rounds and Rx to comments. compare to 8.05.09 Assistance Work Windmills Brian D christens one of our new platforms Thanks to Jeremy, Yoon, Brian, Xuan Mai, Shane, Paul and Becca for lending a hand with the platform construction Happy Birthday, Erik K!"
        },
        {
          "date": "2009-08-05",
          "title": "&#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/08/05/200985cindy-html.html/",
          "summary": "Workout: As many rounds as possible in 20 minutes of: 5 Pull-ups 10 Push-Ups 15 Squats Feel free to cut volume and do \"mini Cindy\" which is a 10 minute amrap. Post rounds to comments. compare to 12.1.08 and 9.10.08 Accessory Work Foam Roll Love Ryan Jeff Martin on Intensity CF Affiliate Blog"
        },
        {
          "date": "2008-12-21",
          "title": "&#8220;Cindy&#8221; or &#8220;Mary&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/12/21/20081221cindy-or-mary-html.html/",
          "summary": "Workout: \" Cindy \" Complete as many rounds in 20 minutes as you can of: 5 Pull-ups 10 Push-ups 15 Squats \" Mary \" Complete as many rounds in 20 minutes as you can of: 5 Handstand Push-ups 10 One legged squats, alternating 15 Pull-ups Post your choice of girls and rounds completed to comments. Compare \"Cindy\" to 9.10.08 Accessory work Handstand Progressions Willkommen zurück, Andy!! A solid DB rack"
        },
        {
          "date": "2008-09-10",
          "title": "&#8220;Cindy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/09/10/2008910cindy-html.html/",
          "summary": "Workout: Max Rounds in 20 minutes of: 5 Pull-ups 10 Push-ups 15 Squats Accessory work: Snatch Deadlifts + Snatch Pulls Makenna and Julie try our the new state of the art \"dip bars\""
        }
      ]
    },
    {
      "name": "Fran",
      "count": 18,
      "latest_date": "2017-06-26",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/06/26/crush-week-fran-2.html/",
      "occurrences": [
        {
          "date": "2017-06-26",
          "title": "Crush Week: &#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/06/26/crush-week-fran-2.html/",
          "summary": "“Fran”: For Time: 21-15-9 Thrusters 95/65 Pull-Ups This is the classic CrossFit couplet that has inspired and hooked so many CrossFitters over the years. So simple, yet so potent. The intention is for this to be brutally fast. The fastest times world-wide are completed unbroken and under 2 minutes. Scale accordingly. However, as always, there’s is room to gut out Rx’ing a benchmark such as this at"
        },
        {
          "date": "2016-12-17",
          "title": "Crush Week: &#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/17/crush-week-fran.html/",
          "summary": "“Fran”: For Time: 21-15-9 Thrusters 95/65 Pull-Ups This is THE classic CrossFit couplet that has inspired and hooked so many CrossFitters over the years. So simple, yet so potent. The intention is for this to be brutally fast. The fastest times world-wide are completed unbroken and under 2 minutes. Scale accordingly. However, as always, there’s is room to gut out Rx’ing a benchmark such as this at"
        },
        {
          "date": "2016-08-08",
          "title": "Crush Week: &#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/08/08/201688crush-week-fran-html.html/",
          "summary": "“Fran”: For Time: 21-15-9 Thrusters 95/65 Pull-Ups This is THE classic CrossFit couplet that has inspired and hooked so many CrossFitters over the years. So simple, yet so potent. The intention is for this to be brutally fast. The fastest times world-wide are completed unbroken and under 2 minutes. Scale accordingly. However, as always, there’s is room to gut out Rx’ing a benchmark such as this at"
        },
        {
          "date": "2015-08-03",
          "title": "2015 Games Event #10 or &#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/08/03/2015832015-games-event-10-or-fran-html.html/",
          "summary": "2015 Games Event #10: The Triangle Triplet For Time, 15-10-6: Thrusters 165/115 Bar Muscle-Ups or | “Fran”: For Time, 21-15-9: Thrusters 95/65 Pull-Ups Compare to 10.17.2014 Post time and Rx to comments. Dan making running look fun. Need some running training tips? Check out this article from CFSBK’s old Endurance Program coach, Mike O., who left us for the West Coast | Photo by Thomas H. | Chasin"
        },
        {
          "date": "2014-09-17",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/09/17/2014917fran-html.html/",
          "summary": "“Fran”: 21-15-9 Reps For Time of: Thruster 95/65 Pull Ups Post time and Rx to comments. Compare to 10.2.2013 and 2.13.2013 . Coach DO and Dan go to the video for further analysis. (Or are they just Googling cat memes?) | Upcoming Schedule Changes: Saturday 9/20: 11am/12pm Active Recovery CANCELLED Sunday 9/21: 11am Active Recovery CANCELLED Saturday 10/4: 11am/12pm Active Recovery CANCELLED | Walk"
        },
        {
          "date": "2013-10-02",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/10/02/2013102fran-html.html/",
          "summary": "Workout: 21-15-9 Rep rounds for time of: Thrusters, 95/65 Kipping Pull-Ups Scale the workout appropriately and work on your discomfort tolerance today. Post time and Rx to comments. compare to 2.13.13 Congratulationt to Matt Cohen and his wife on the birth of Violet! Violet Octavia Cohen, 7 lbs and 10 ounces, was born at 2:02 AM on September 19th after only 90 minutes of labor. She was almost born"
        },
        {
          "date": "2013-02-13",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/02/13/2013213fran-html.html/",
          "summary": "Workout: 21-15-9 Rep rounds for time of: Thrusters, 95/65 Kipping Pull-Ups Scale the workout appropriately and work on your discomfort tolerance today. Post time and Rx to comments. compare to 1.30.13 and 12.2.12 Nate O on Heavy Carries"
        },
        {
          "date": "2012-12-02",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/12/02/2012122fran-html.html/",
          "summary": "Workout: 21-15-9 Rep rounds for time of: Thrusters, 95/65 Pull-Ups Post time and Rx to comments. compare to 9.10.11 or 7.27.11 Weird POV Squats with Coach Nick"
        },
        {
          "date": "2012-07-29",
          "title": "&#8220;Ladder Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/07/29/2012729ladder-fran-html.html/",
          "summary": "Fitness: 5-10-15-10-5 Reps for time of: Dumbbell Thrusters Jumping Pull Ups or Ring Rows __________________ | Performance: 5-10-15-10-5 Reps for time of: Thrusters 95/65 Kipping Pull Ups If you are doing any version of a strict pull-up, perform 3-6-9-6-3 reps Post time and Rx to comments. compare to “Fran” and “Narf” Sarah J looking comfortable at the bottom of a 1RM Happy Birthday, Kate D ! | Dum"
        },
        {
          "date": "2011-08-27",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/08/27/2011827fran-html.html/",
          "summary": "Workout: 21-15-9 Rep Rounds for Time of: Thrusters, 95/65 Pull-Ups Post time and Rx to comments. compare to 5.23.11 ALL HAIL FRAN!"
        },
        {
          "date": "2011-06-26",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/06/26/2011626fran-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: Thrusters, 95/65 Pull-Ups Post Rx and time to comments. compare to %80 Font Portia H Push Jerks This is a 120% Font Bolded When you use a header it automatically creates a permanent page break which I don’t like. Using 120% allows me to keep the text more condensed. Also, the HTML works just like in Typepad for the image, which is dope. __________________ Don’t f"
        },
        {
          "date": "2011-05-07",
          "title": "Fran",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/05/07/201157fran-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: Thrusters 95/65 Pull-ups Post RX, times and experience to comments Compare to 12.13.10 Look Ma, No Hands! We flipped the script! New Group Class Strength Cycle Programming For this cycle we're shaking things up a bit in our group class scheduling. Here is the schedule for the the next 4 weeks. Monday: HSPU Tuesday: Rest Day Wednesday: Heavy Squat Thursday: Met Co"
        },
        {
          "date": "2010-12-13",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/12/13/20101213fran-html.html/",
          "summary": "Workout: 21-15-9 reps for time of: Thrusters 95/65 Pull-Ups Post time and Rx to comments. compare to 5.16.10 Welcome back, Coach Laurel and Malcolm! Remember that TONIGHT is our first Monday 8pm Group Class . Be there or be square, night owls! This Wednesday at 6pm CFSBK's Strength Athletes will test the last 8 weeks of their hard work with the CROSSFIT TOTAL . Come early, stay late or just come o"
        },
        {
          "date": "2010-05-16",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/05/16/2010516fran-html.html/",
          "summary": "Workout: 21-15-9 reps for time of: Thrusters 95/65 Pull-Ups Post time and Rx to comments. compare to 2.8.09 Yep, \"Fran\" CFSBK at the 5th Ave Fair Today! As you know, we are participating in the 5th Ave Fair today from 11am-6pm. We'll be stationed next to Bierkraft between Union and Berkeley. We want to show Park Slope what a bunch of badasses you are, so we're planning some demo WODs throughout th"
        },
        {
          "date": "2009-02-08",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/02/08/200928fran-html.html/",
          "summary": "Workout: 21-15-9 reps for time of: Thrusters 95/65 Pull-Ups Post time to comments. Accessory Work Goat or core work Laurel sets up a deadlift from yesterday's WOD"
        },
        {
          "date": "2008-12-03",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/12/03/2008123fran-html.html/",
          "summary": "Workout: Three rounds, 21-15- and 9 reps, for time of: 95 pound Thruster Pull-ups Post time to comments compare to 9.18.08 and 5.10.08 Accessory Work Buelers! Mobility Wk2 Adrian Bozman Affiliate Challenge at CrossFit Hoboken \"Over at CrossFit Hoboken , we think it's time for some friendly competition. We will be holding an Event on Dec 20th at CrossFit Hoboken . We would like to invite all of you"
        },
        {
          "date": "2008-09-18",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/09/18/2008918fran-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: 95 lb Thruster Pull-ups Post Time to Comments. Accessory work Depth Jumps Rower Technique work Charmel Fight Gone Bad Schedule: 10-10:15 Arrival and registration 10:15-10:45 Overview and group warm-up 11-11:20 Heats 1 & 2 11:30-11:50 Heats 3 & 4 12-12:20 Heats 5 & 6 12:30-1 Awards + Wrap up We expect things to drag out a little but as long as everyone shows up on"
        },
        {
          "date": "2008-05-10",
          "title": "&#8220;Fran&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/05/10/2008510fran-html.html/",
          "summary": "Workout: Three rounds, 21-15- and 9 reps, for time of: 95 pound Thruster Pull-ups Post time to comments. Compare to CFSBKWOD 1.27.08 The First person to show me a receipt from their purchase of weightlifting shoes gets one free personal training session! (we will focus on an Olympic lift) The Second person to show me their receipt gets 2 free classes (40$ Value) The Third person gets… the awesome "
        }
      ]
    },
    {
      "name": "Grace",
      "count": 14,
      "latest_date": "2016-12-15",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/15/crush-week-isabel-and-grace.html/",
      "occurrences": [
        {
          "date": "2016-12-15",
          "title": "Crush Week: &#8220;Isabel&#8221; and &#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/15/crush-week-isabel-and-grace.html/",
          "summary": "“Isabel”: For Time: 30 Snatches 135/95 Start at 0:00. 7 minute cap. Post time and Rx to comments. Compare with 6.7.15 _____________________ | “Grace”: For Time: 30 Clean and Jerks 135/95 Start at 20:00. 7 minute cap. Post time and Rx to comments. Compare with 10.13.16 Our friends at Spartan Race are gearing up for the 2017 season and want you to know that they’re offering three different season pa"
        },
        {
          "date": "2016-12-15",
          "title": "Crush Week: &#8220;Isabel&#8221; and &#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/15/crush-week-isabel-and-grace-2.html/",
          "summary": "“Isabel”: For Time: 30 Snatches 135/95 Start at 0:00. 7 minute cap. Post time and Rx to comments. Compare with 6.7.15 _____________________ | “Grace”: For Time: 30 Clean and Jerks 135/95 Start at 20:00. 7 minute cap. Post time and Rx to comments. Compare with 10.13.16 Our friends at Spartan Race are gearing up for the 2017 season and want you to know that they’re offering three different season pa"
        },
        {
          "date": "2016-10-13",
          "title": "Crush Week: &#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/10/13/20161013crush-week-grace-html.html/",
          "summary": "“Grace”: For Time: 30 Clean and Jerks 135/95 The Cleans for this benchmark should be power and the Jerks are shoulder-to-overhead anyhow. Be sure to come to complete knee and hip extension with the bar held overhead at the top of each rep. If you can do the Rx’d loads, then go for it. Choose a weight when scaling that allows you to get through the 30 reps fast. You can cycle or you can do singles "
        },
        {
          "date": "2016-05-05",
          "title": "Clean and Jerk | &#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/05/05/201655clean-and-jerk-grace-html.html/",
          "summary": "Clean and Jerk: Performance The Shankle Complex: 1 Clean Deadlift + 3 Clean Pulls + 1 Hang Clean + 2 Jerks Start at about 50% and work up to a heavy load on the complex . Focus on keeping your weight balanced toward the heels on the Deadlift and extending vertically on the pulls. Fitness 5 attempts at a heavy load on the following complex: Clean Deadlift + Hang Clean + Push Press or Jerk Post load"
        },
        {
          "date": "2015-09-05",
          "title": "Clean and Jerk | &#8220;2-Mile Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/09/05/201595clean-and-jerk-2-mile-grace-html.html/",
          "summary": "Clean and Jerk: Take 12 minutes to warm up a bit beyond your clean and jerk weight for the WOD. Post loads to comments. _____________________ | “2-Mile Grace”: For Time: 1-Mile Run 30 Clean and Jerks 135/95 1-Mile Run The fastest “Grace” times are around 2 minutes. For scaling, choose a weight here that you can throw around a bit, maybe even cycle some of the reps and finish the barbell portion in"
        },
        {
          "date": "2012-08-13",
          "title": "&#8220;1K Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/08/13/20128131k-grace-html.html/",
          "summary": "Workout: For Time: Row 1000m Rest 2:00 30 Clean and Jerks, 135/95 If you haven’t developed a sound technical base with the clean and jerk, perform a Deadlift, Hang Power Clean and Push Press instead. Post Rx, 1K time, Grace Time and total time to comments. In The Eye Of The Storm CFSBK would like to wish Matt H and his family the best of luck as they move to West Hollywood to start a new chapter i"
        },
        {
          "date": "2012-04-02",
          "title": "&#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/04/02/201241grace-html.html/",
          "summary": "Workout: 30 Clean and Jerks for Time There is a 10 minute cap on today’s workout Post time and Rx to comments. compare to 12.29.11 and 8.25.11 Post Seminar Coaches Congratulations to Marian L on her 25lb BSQ PR of 155lbs! Are you an April Birthday ? Let us know on the board by the community area! DO NOT use permanent marker!!! Also- Don’t Forget to write your April Goals and March/April Accomplish"
        },
        {
          "date": "2011-12-29",
          "title": "Rack Jerk/Grace",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/12/29/20111229rack-jerkgrace-html.html/",
          "summary": "Workout: Spend 20 minutes finding a 1RM Rack Jerk Athletes will take weight out of rack but can bail as necessary. Athletes may Split Jerk Post loads to comments. Compare to 7.7.11 Then, “Grace” 30 Clean and Jerk for time 135/95 Post time and RX to comments. Compare to 8.25.11 We’re Here: New CFSBK Hoodies are In !"
        },
        {
          "date": "2011-08-25",
          "title": "&#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/08/25/2011825grace-html.html/",
          "summary": "Workout: 30 reps for time of: Clean and Jerk 135/95 7 Minute Cap This WOD is ideally done incredibly fast, in 2-4 minutes or less, which is why we’ve done a 3-4 minute cap on her before. You can scale this to be able to achieve the desired result or, maybe today you go for a heavier weight and gut it out…if you’ve got the guts. Either way your goal should be to STAY ON THE BAR…you only need to cha"
        },
        {
          "date": "2011-06-04",
          "title": "Grace",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/06/04/201164grace-html.html/",
          "summary": "Workout: Take 20 Minutes to find a 1RM Clean and Jerk then, \"Grace\" For time: 30 Clean and Jerks 135/95 There is a 3 minute cap on this workout so choose a weight that allows you to complete all 30 reps in under 3 minutes. If you don't finish all reps: score is reps completed, and row a 500 meter (NFT) penalty for each rep not completed. For example, if you only complete 26 reps you row a 2K. Cons"
        },
        {
          "date": "2010-06-06",
          "title": "&#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/06/06/201066grace-html.html/",
          "summary": "Workout: For time: 30 Clean and Jerks 135/95 Post time and weight to comments. compare to 1.31.10 Monday begins back-off week! During the upcoming week we'll be increasing our focus on skill/technique development, dynamic mobility, foam rolling and general maintenance before heading into another month of action-packed programming. Accessory Work : DIY Foam Rolling/Lacrosse Ball Soft Tissue Work * "
        },
        {
          "date": "2010-01-31",
          "title": "&#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/01/31/2010131grace-html.html/",
          "summary": "Workout: For time: 30 Clean and Jerks 135/95 Post time and weight to comments. compare to 3.16.08 Our \"soft open\" is today from 10am-12pm. Come on down for some socializing, celebrating and lots and lots of bailing. Our new schedule will go into effect tomorrow. Welcome back, CrossFit South Brooklyn! Bjorn returns an Erg and sneaks in one more workout Happy Birthday, Frank A ! ____________________"
        },
        {
          "date": "2009-03-05",
          "title": "&#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/03/05/200935grace-html.html/",
          "summary": "Workout: 30 Clean and Jerks for time 135/95 Post time to comments. compare to 3.18.08 Accessory Work The subtle art of resetting your pulls Dynamic Mobility Mature Support Practice 455, OWNED. Great work, Charmel! \"What do you do for recreation? Oh the usual. I bowl. Drive around. The occasional Acid flashback.\" What: Bowling! When: This Saturday @ 9pm! Where: Melody Lanes, 461 37th Street in Broo"
        },
        {
          "date": "2008-03-16",
          "title": "&#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/03/16/2008316grace-html.html/",
          "summary": "Workout: 30 Clean and Jerks for time 135, 85 or an otherwise appropriate weight. Beginners who were not confident with the clean and jerk worked on the movement with a PVC and light weight. Technique before intensity. Skills: After class we had \"open training\" for an hour so the athletes could work on whatever skills they wanted to develop. Remember that tomorrow night is our first Monday night cl"
        }
      ]
    },
    {
      "name": "Helen",
      "count": 13,
      "latest_date": "2018-09-05",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/09/05/back-squat-helen.html/",
      "occurrences": [
        {
          "date": "2018-09-05",
          "title": "Back Squat | &#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/09/05/back-squat-helen.html/",
          "summary": "Back Squat: Fitness 3×5 LP Heavier than last week. Performance 80% x 3, 80% x Max Reps (more than Week 1) Warm up, then perform one set of 3 at 80% (of 1RM), followed by a max rep set at the same load. Use a spotters, but aim to end the set 1 rep shy of failure. The goal is no failing. Post loads to comments. Exposure 5 of 8 _____________________ | “Helen”: 3 Rounds for Time: 400m Run 21 Kettlebel"
        },
        {
          "date": "2017-09-02",
          "title": "Back Squat Test | &#8220;Helen for Houston&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/09/02/back-squat-test-helen-for-houston.html/",
          "summary": "Back Squat Test: Performance 1-1-1-1-1 Fitness 3-3-3-3-3 Warm up and establish a new 1RM or 3RM. No tempo today! Post loads to comments. _____________________ | “Helen for Houston”: 3 Rounds for Time: 400m Run 21 Kettlebell Swings, 1.5/1 pood 12 Pull-Ups Post time and Rx to comments. | Helen for Houston: For today workout, we’re teaming up with our friends at beyond the whiteboard to support their"
        },
        {
          "date": "2016-07-17",
          "title": "Clean and Jerk | &#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/07/17/2016717clean-and-jerk-helen-html.html/",
          "summary": "Halted Clean + Mid-Hang Clean + Power Jerk: 1-1-1-1-1 Work up to a heavy load on the complex. Pause for 3 seconds at the Mid-Hang, then move directly into the Clean. Your weight should still be balanced slightly towards the heel at the Mid-Hang. Post loads to comments. Exposure 5 of 8 __________________ | “Helen”: 3 Rounds for Time: 400m Run 21 Kettlebell Swings 24/16kg 12 Pull-Ups This classic Cr"
        },
        {
          "date": "2015-10-18",
          "title": "Snatch | &#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/10/18/20151018snatch-helen-html.html/",
          "summary": "Workout: Every 90 Seconds for 12 Minutes (8 total sets): Fitness : 3 Snatches (bail and reset each rep) Performance : 2 Touch-and-Go Power Snatch + Hang (full) Snatch Start at 60% and add weight as appropriate. Post loads to comments. Exposure 1/8 _____________________"
        },
        {
          "date": "2015-05-31",
          "title": "Snatch | &#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/05/31/2015531snatch-helen-html.html/",
          "summary": "Workout: Fitness and Performance : 1-1-1-1-1 Work up to a heavy single for the day. Aim for about 90% of your 1RM. If you’re feeling good then go for a new 1RM, if not, back off. Post loads to comments. e8/8 _____________________"
        },
        {
          "date": "2013-06-08",
          "title": "&#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/06/08/201368helen-html.html/",
          "summary": "Workout: 3 Rounds For Time of: Run 400m 21 Kettlebell Swings 24k/16k 12 Kipping Pull-Ups Post time and Rx to comments. compare to 10.13.12 Cassie Xu getting her front rack position ready during standardized warm-ups Don’t forget to sign up for your CrossFit Total session tomorrow on the google doc . Also, please read yesterday’s post about what the Total is and what to expect. Happy Baby shower to"
        },
        {
          "date": "2012-10-13",
          "title": "&#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/10/13/20121013helen-html.html/",
          "summary": "Workout: 3 Rounds For Time of: Run 400m 21 Kettlebell Swings 24k/16k 12 Kipping Pull-Ups Post time and Rx to comments. compare to 8.22.11 Sadie says, “COME TO THE BABY MUSTER TODAY! “ We’ve got about 10 families RSVP’d for the Baby Muster starting at 1:15pm today. The age range goes from fetus to about 5 years old, all families and children are welcome! Erica will be bringing some fruit and seltze"
        },
        {
          "date": "2011-08-22",
          "title": "&#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/08/22/2011822helen-html.html/",
          "summary": "Workout: 3 Rounds for time of: Run 400m 21 Kettlebell Swings, 1.5p/1p 12 Pull-Ups Post time and Rx to comments. compare to 6.5.11 “Helen” Demo CrossFit Patrick gets to the Muscle-Ups at Event 2 of the CF Subway Series Welcome back Coach Shane from the Functional Movement Screen certification he attended this weekend! We can’t wait to learn and then apply the new insights he learned from this fanta"
        },
        {
          "date": "2011-06-05",
          "title": "Helen",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/06/05/201165helen-html.html/",
          "summary": "Workout: 3 Rounds for time of: Run 400m 21 KB Swings 12 Pull Ups Post time and Rx to comments. Compare to 11.14.10 Noor A. Chips away during Murph Be Scurred! Scary Movie Night is next Saturday, June 11th. We'll be showing tow great fright flicks \"The Descent\" at 8pm and \"Ils\" aka \"Them \" 10pm. Feel free to bring your favorite movie snacks and drinks (Paleo or otherwise). This event is the brainch"
        },
        {
          "date": "2010-11-14",
          "title": "&#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/11/14/20101114helen-html.html/",
          "summary": "Workout: 3 Rounds For Time: Run 400m 21 KB Swings 1.5pd/1pd 12 Pull-ups Post time and Rx to comments. Compare to 7.18.10 and 3.25.10 Alec H warming up for his 20 reps. Ragnar Relay Info Session Join Sarah H. today for a general information session about the Ragnar Relay. Are you in? Are you unsure? Doesn't matter all are encouraged to participate. Come on in to the gym and find out more today at 1"
        },
        {
          "date": "2010-07-18",
          "title": "&#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/07/18/2010718helen-html.html/",
          "summary": "Workout: 3 Rounds for time of: Run 400m 21 Kettlebell Swings 1.5p/1p 12 Pull-Ups Post time and Rx to comments. compare to 3.25.10 Mobility Triplet Walking OH Reach Lunge Sumo Squat to stand Blackburns Which of these movements was most difficult for you? Why? David M works the atlas stones at Quist yesterday Good luck to Steph P and Christine G competing in the NYC Triathlon today! Are you a relati"
        },
        {
          "date": "2010-03-25",
          "title": "&#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/03/25/2010325helen-html.html/",
          "summary": "Workout: 3 Rounds for time of: Run 400m 21 Kettlebell Swings, 1.5p/1p 12 Pull-Ups Post time and Rx to comments. This is our first ever \"official\" Helen with running as opposed to rowing. Birds eye view of the Run, Wall Ball couplet 12 SBK'ers have alright signed up for the Wine Wasting . Only 8 slots left! New Spring Classes for Kira D's cooking school, The Oakridge Kitchen have been posted! Check"
        },
        {
          "date": "2008-06-02",
          "title": "&#8220;Helen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/06/02/200862helen-html.html/",
          "summary": "Workout: 3 Rounds For Time of: Run 400m 21 Kettlebell Swings 1.5 Pood 12 Pull-Ups ************************ Remember that we are combining the Beginner and Group classes today and meeting at HARMONY PARK in Prospect Park at 6:45pm ************************ A couple more shots from the challenge: Jeremy Rows 1K David is not enjoying these SDHPs CHECK OUT THESE BADASS SHIRTS JOHN C. MADE FOR US!!!"
        }
      ]
    },
    {
      "name": "Diane",
      "count": 12,
      "latest_date": "2018-01-22",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/01/22/crush-week-diane.html/",
      "occurrences": [
        {
          "date": "2018-01-22",
          "title": "Crush Week: &#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/01/22/crush-week-diane.html/",
          "summary": "“Diane”: For Time: 21-15-9 Deadlifts 225/155 Handstand Push-Ups The Deadlift weight should be medium-heavy for you, and completed in 1-3 sets. Scale load as needed. For most athletes, however, this benchmark is more about the Handstand Push-Ups. To Rx this workout, you should be able to complete sets of 6-10 reps or more when fresh. If you can not complete at least 6 Handstand Push-Ups in a row, t"
        },
        {
          "date": "2016-10-10",
          "title": "Crush Week: &#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/10/10/20161010crush-week-diane-html.html/",
          "summary": "“Diane”: For Time: 21-15-9 Deadlifts 225/155 Handstand Push Ups This benchmark (and CFSBK Leaderboard) workout is done unbroken on the fast end, with top times world-wide under 2 minutes. Average times, however, creep up into double digits. We’ll have a soft 15 minute cap today, so feel free to make it more of a strength workout and challenge yourself via load on the bar and/or degree of difficult"
        },
        {
          "date": "2016-05-26",
          "title": "Rack Jerk | &#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/05/26/2016526rack-jerk-diane-html.html/",
          "summary": "Rack Jerk: 1-1-1-1-1 Work up to a max Jerk for the day. If you’re newer to the lift, then work up a max Power Jerk or Push Press. Post loads to comments. __________________ Performance | “Diane”: For Time: 21-15-9 Deadlifts 225/155 Handstand Push-Ups Scale the Handstand Push-Ups to 1 or 2 AbMats as appropriate or scale volume to 15-9-6, or even 12-6-3. Fitness For Time: 21-15-9 Deadlifts Push-Ups "
        },
        {
          "date": "2015-12-07",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/12/07/2015127diane-html.html/",
          "summary": "“Diane”: 21-15-9 Reps For Time: Deadlifts 225/155 Handstand Push-Ups Scale the load on the deadlift so that you can perform at least 10 reps unbroken, or around 70% of your 1RM. Kipping is allowed on the handstand push-ups as long as you can maintain tension throughout, aka, don’t rest your body weight on your head and neck. Scaling for handstand push-ups is 1 or 2 AbMats or heavy dumbbell push pr"
        },
        {
          "date": "2015-01-12",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/01/12/2015112diane-html.html/",
          "summary": "“Diane”: 21-15-9 Reps For Time: Deadlifts 225/155 Handstand Push Ups Post time and Rx to comments. Compare to 11.4.2013 and 2.16.2013 . Kristie F. at the top of her push-up | News and Notes: There are two spots left in Ken H.’s gymnastics strength training class , which meets Sundays from 2-3:30pm, 1/18, 1/25, 2/1, and 2/8. $80 for four weeks, register here ! LAST CHANCE to sign up for Coach Frank"
        },
        {
          "date": "2014-06-12",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/06/12/2014612diane-html.html/",
          "summary": "Workout: Fitness AMRAP 10 minutes: 5 Deadlift 225/155 5 Push Up 10 Deadlift 10 Push Up 15 Deadlift 15 Push Up 20 Deadlift 20 Push Up 25 Deadlift 25 Push Ups Etc. Add 5 reps per round Performance “Diane” 21-15-9 reps for time of: Deadlift 225/155 Handstand Push Ups Shaneve getting her squat on at “Murph”"
        },
        {
          "date": "2013-11-04",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/11/04/2013114diane-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: Deadlift 225/155 Handstand Push-Ups There is a 12 minute cap on this workout. Post time and Rx to comments. compare to 2.16.13"
        },
        {
          "date": "2013-02-16",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/02/16/2013216diane-html.html/",
          "summary": "Workout: 21-15-9 Reps For Time of: Deadlift 225/155 Handstand Push-Up WOD Demo Post time and Rx to comments. compare to 12.14.11 and 8.8.11 7 properly locked bikes on the Bike Rack If you ride your bike to the gym, please make sure you’re locking up your bike correctly. Drape the front wheel over the top cross beam and lock your tire and frame to the rack, like this: Please don’t lock your bike pa"
        },
        {
          "date": "2011-12-14",
          "title": "Dead Stop &#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/12/14/20111214dead-stop-diane-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: Deadlift 225/155 Handstand Push-Ups Today’s “Diane” is dead stop, meaning each deadlift needs to be pulled from the floor without the benefit of a bounce. For some, this may mean decreasing the load since this version is more challenging. As always, prioritize alignment on your set ups. Post time and Rx to comments. compare to 8.8.11 Sarah H2 shows us her game fa"
        },
        {
          "date": "2011-08-08",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/08/08/201188diane-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: Deadlift, 225/155 Handstand Push-Ups If you can’t perform a full range of motion handstand push-up, you can scale the movement by placing 2 or 3 abmats under your head. Otherwise, you could choose between a strict dumbbell press or even standard Push-ups. The deadlift should feel somewhat heavy but each rep round shouldn’t take you more than 3 sets to complete. “"
        },
        {
          "date": "2010-09-27",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/09/27/2010927diane-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: Deadlift 225/155 Handstand Push-Ups If you don't have handstand push-ups, you can either scale to partial range of motion or Dumbbell Press using 40% of your bodyweight. Our upcoming cycle will feature handstand push-ups as the upper body movement. Today's WOD is a pretest. Post time and Rx to comments. compare to 8.17.08 \"Diane\" with Annie and Pat \"Dizzy Diane\" "
        },
        {
          "date": "2008-08-17",
          "title": "&#8220;Diane&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/08/17/2008817diane-html.html/",
          "summary": "Workout: 21-15-9 reps, for time: Deadlift 225lbs Handstand Push-ups Accessory work: Split Jerk Foot work Lever work Post time to comments. Hillary 15 Members, $736 raised to far. Team South Brooklyn Chilli-Rubbed Skirt Steak Chinese Weightlifting (again, and still cool)"
        }
      ]
    },
    {
      "name": "Jackie",
      "count": 10,
      "latest_date": "2018-03-26",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/03/26/press-look-feel-perform-better-challenge-capacity-test.html/",
      "occurrences": [
        {
          "date": "2018-03-26",
          "title": "Press | Look, Feel, Perform Better Challenge Capacity Test",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/03/26/press-look-feel-perform-better-challenge-capacity-test.html/",
          "summary": "Press: Performance 1-1-1 Fitness 3-3-3 Warm up and work up to a heavy single Press. We’re doing strict Presses today. No knees and no moving your feet! A little lay back is okay but don’t get crazy . Post loads to comments. _____________________ | LFPB Challenge Capacity Test WOD: “Jackie”: For Time: 1000m Row 50 Thrusters 45# 30 Pull-Ups This classic benchmark (and CFSBK Leaderboard item) should "
        },
        {
          "date": "2018-01-01",
          "title": "Handstand Push-Up / Dumbbell Split-Stance Romanian Deadlift | LFPB Capacity Test WOD: &#8220;Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/01/01/wod-1-1-18.html/",
          "summary": "Handstand Push-Up / Dumbbell Split-Stance Romanian Deadlift Superset*: Performance A1) Tempo (40×1) Handstand Push-Up: 5 x 6-10 reps Add a few reps to last week. These should all be sub-max sets, adding a deficit if you’re able to. Full range of motion, no AbMats. No crashing or resting on your head! Perform the reps strict if you can. You can kip the concentric if you must, but keep true to the t"
        },
        {
          "date": "2016-09-29",
          "title": "Clean and Jerk | &#8220;Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/09/29/2016929clean-and-jerk-jackie-html.html/",
          "summary": "Power Clean and Push Jerk: Every minute on the minute x 15: 2 Power Clean and Push Jerks These will add up quickly, so start modest on the load and only increase if the reps feel crisp. Do them touch-and-go if you can organize them. Do quick bailed singles if you cannot. Post loads to comments. Exposure 7 of 8 _____________________ | “Jackie”: For Time: 1000m Row 50 Thrusters, 45 lbs 30 Pull-Ups T"
        },
        {
          "date": "2014-05-05",
          "title": "Bench Press | &#8220;Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/05/05/201455bench-press-jackie-html.html/",
          "summary": "“Jackie”: 1000m Row 50 Thrusters 45# 30 Kipping Pull-Ups Compare to 11.27.2010 . In its best capacity, “Jackie” is an evenly-paced, unbroken suck fest. Try and go dark today. Post time and Rx to comments. The Mayhem in the Meadowlands crew"
        },
        {
          "date": "2011-08-11",
          "title": "&#8220;Double Half Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/08/11/2011811double-half-jackie-html.html/",
          "summary": "Workout: For Time: Row 500m 25 Thrusters, 45lbs 15 Pull-Ups Row 500m 25 Thrusters, 45lbs 15 Pull-Ups Dropping an empty barbell results in an on the spot 10 burpee penalty! Post time and Rx to comments. compare to normal “Jackie” 11.27.10 Spend the remainder of class working on mobility, particularly shoulder internal rotation/extension and hip internal rotation Holy Katz! Check out Matt K at the f"
        },
        {
          "date": "2010-11-28",
          "title": "&#8220;Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/11/28/20101128jackie-html.html/",
          "summary": "Workout: For time: Row 1000m 50 Thrusters 45lbs 30 Pull-ups Post time and Rx to comments. Compare to 8.29.10 and 12.27.09 Skill Work Spend 10 minutes working on your Freestanding Handstand Melissa hitting HSPUs CF Kids do Lil' Jackie & Jackie Crossfit.com CF Celebrity DeathMatch \"Greg Admundson vs. Level 1 Trainers-Jackie\" Crossfit.com Handstand Development w/ Roger Harrell Crossfit.com Handstand "
        },
        {
          "date": "2010-08-29",
          "title": "&#8220;Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/08/29/2010829jackie-html.html/",
          "summary": "Workout: For time: Row 1000m 50 Thrusters, 45lbs 30 Pull-Ups Have you done \"Jackie\" several times and are pleased with your time? Consider scaling up by increasing the thruster weight to 65lbs and substituting 10 Muscle-Ups for the pull-ups. Post time and Rx to comments. compare to 12.27.09 Ben G attempts 225 at our last CrossFit Total Happy Belated birthday, Dan H ! The movements for this cycle a"
        },
        {
          "date": "2009-12-27",
          "title": "&#8220;Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/12/27/20091227jackie-html.html/",
          "summary": "Workout: For time: Row 1000m 50 Thrusters, 45lbs 30 Pull-Ups post time to comments. compare to 6.20.09 Skill Work Mid Hang Power Snatch Vincent does some movement prep Repost! The Sectionals Qualifiers for the 2010 CrossFit Games is now up: New York / New Jersey Sectional: March 27-28 19 Elm St., Montclair, NJ 07042 New York, New Jersey Regional Seeds: 30 men, 30 women Click Here to register as an"
        },
        {
          "date": "2009-06-20",
          "title": "&#8220;Jackie&#8221; versus CrossFit NorCal",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/06/20/2009620jackie-versus-crossfit-norcal-html.html/",
          "summary": "Workout: For time: Row 1000 meters 45lb Thruster, 50 reps Pull-ups, 30 reps Scale Thrusters to 35lbs and Pull-ups to Jumping Pull-ups if necessary. Post time to comments compare to 12.20.08 How to read the Monitor Next Month's Challenge vs. CF NorCal: Back Squat 1-1-1 Let's see which gym can move the most weight with three attempts at a 1RM! Individual bests and a group total will all count for th"
        },
        {
          "date": "2008-12-20",
          "title": "&#8220;Jackie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/12/20/20081220jackie-html.html/",
          "summary": "Workout: For time: Row 1000 meters 45lb Thruster, 50 reps Pull-ups, 30 reps Post time to comments. Accessory Work 3 Rounds NFT of: 10 Medball Cleans 10 Knee To Elbows Mobility wk 4 Journaling is an essential part of your training. Without a record of what you've done, strategizing WODs becomes a guessing game. Your log shouldn't just include the workout, your weights and/or a time. Here are some i"
        }
      ]
    },
    {
      "name": "Annie",
      "count": 9,
      "latest_date": "2023-05-21",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2023/05/20/sunday-5-21-23.html/",
      "occurrences": [
        {
          "date": "2023-05-21",
          "title": "Sunday 5.21.23",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2023/05/20/sunday-5-21-23.html/",
          "summary": "“Running ANNIE”: For time: 50 Double Unders 50 Sit-Ups Run 130m 40 Double Unders 40 Sit-Ups Run 130m 30 Double Unders 30 Sit-Ups Run 130m 20 Double Unders 20 Sit-Ups Run 130m 10 Double Unders 10 Sit-Ups Run 130m Notes This is a twist on a classic benchmark workout. Try to keep moving and push the pace! Scale the Double unders to half volume if needed or double the reps for single unders."
        },
        {
          "date": "2018-10-03",
          "title": "Box Squat | &#8220;Annie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2018/10/03/box-squat-annie.html/",
          "summary": "Tempo Box Squat (41X2): Heavy 3 In 15 minutes, work up to a heavy set of 3 reps of a Box Squat at the prescribed tempo (4 seconds down, 1 second hold on the box, fast up, and 2 seconds at the top). “Sit” on the box for the 1 count while maintaining a braced torso and an active hip. Post loads to comments. _____________________ “Annie” For Time: 50-40-30-20-10 Double-Unders Sit-Ups This benchmark “"
        },
        {
          "date": "2017-07-23",
          "title": "Front Squat / Jerk | &#8220;Annie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/07/23/front-squat-jerk.html/",
          "summary": "Front Squat + Jerk: Take the bar from a rack. Work up to a heavy load for the day. Post loads to comments. Exposure 3 of 8 _____________________ | “Annie”: For Time: 50-40-30-20-10 Double-Unders Sit-Ups Benchmark this classic today. Scale the Dubs to Singles or half attempts as needed. It’s OK to use an anchor for the Sit-Ups. Post time and Rx to comments. Kayleigh L. joins the rock formations at "
        },
        {
          "date": "2014-07-31",
          "title": "Overhead Squat | &#8220;Annie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/07/31/2014731overhead-squat-annie-html.html/",
          "summary": "Workout: Overhead Squat: 5-5-5 Work up to a heavy set of 5 on the overhead squat."
        },
        {
          "date": "2012-01-09",
          "title": "Turkish Get-Up to Windmill/Annie",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/01/09/201218turkish-get-up-to-windmillannie-html.html/",
          "summary": "Workout: Spend 20 minutes working up to the heaviest weight possible on the complex"
        },
        {
          "date": "2010-05-03",
          "title": "&#8220;Annie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/05/03/201053annie-html.html/",
          "summary": "Workout: 50-40-30-20-10 reps for time of: Double Unders Sit-Ups Post time to comments. compare to 2.15.10 Suggested Back-Off Week Accessory Work Kipping Pull-Up Practice Caitlin C's Overhead Squats Congratulations to Luisa P and Gabe E on their recent engagement! Upcoming Foundations Cycles: May Evening Cycle Dates: 5/12-6/7 Times: 8pm-9:15pm Register Here! May Morning Cycle Dates: 5/20-6/14 Times"
        },
        {
          "date": "2009-06-21",
          "title": "&#8220;Annie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/06/21/2009621annie-html.html/",
          "summary": "Workout: 50-40-30-20-10 rep for time of Double Unders Sit-ups If you can't do doubles, substitute three singles for every rx'd double Post time to comments. Compare to 5.13.09 or 4.16.09 Accessory Work Kettlebell Fun Swings, Hand offs, Flips, Snatches Erik searches for meaning in \"Jackie\" Congratulations Team NorCal So the results are in and it seems that we've been bested in our first CFSBK vs. C"
        },
        {
          "date": "2009-04-16",
          "title": "&#8220;Annie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/04/16/2009416annie-html.html/",
          "summary": "Workout: 50-40-30-20-10 Rep rounds of: Double Unders Sit-Ups Post time to comments. compare to 6.9.08 Accessory Work 2 Minute Kettlebell Pressure Tests, 3 Rounds The emphasis on today's Accessory Work is consistency and efficiency with your swings. Your score, which is max swings should be considered secondary. Adrian Bozman reviews Burpee Standards We regret to inform interested participants that"
        },
        {
          "date": "2008-06-09",
          "title": "&#8220;Annie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/06/09/200869annie-html.html/",
          "summary": "Workout: 50-40-30-20 and 10 rep rounds of: Double-Unders Sit-Ups Post Time to Comments. Compare to CFSBK 2.17.08 Darren Your body's ability to thermoregulate itself it is directly correlated to your fluid intake. Thirst alone is not the best indicator of dehydration so please remember to drink plenty of water before, during and after training. If you forget to bring water , it can be purchased dow"
        }
      ]
    },
    {
      "name": "Barbara",
      "count": 9,
      "latest_date": "2015-03-29",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/03/29/2015329barbara-html.html/",
      "occurrences": [
        {
          "date": "2015-03-29",
          "title": "Barbara",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/03/29/2015329barbara-html.html/",
          "summary": "“Barbara”: 5 Rounds, For Total Time: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Squats Rest exactly 3 minutes between rounds. Post total time and Rx to comments. Compare to 1.26.2014 and 2.17.2013 Things are coming together across the street! Join us next Saturday (4/4) from 2-3pm for the grand opening of 608 Degraw Street. All regularly-scheduled group classes that day will also have a special surpris"
        },
        {
          "date": "2014-01-26",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/01/26/2014126barbara-html.html/",
          "summary": "Workout: 5 Rounds for time: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Air Squats Rest exactly 3 minutes between rounds. As always, we’ll offer volume and movement scaling options at the gym. Make every rep perfect! Post total time and Rx to comments. compare to 2.17.13 CrossFit interrogation tactics Post time and Rx to comments. 5 Rounds for time: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Air Squats Good "
        },
        {
          "date": "2013-02-17",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2013/02/17/2013217barbara-html.html/",
          "summary": "Workout: 5 Rounds for time: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Air Squats Rest exactly 3 minutes between rounds. There is a 45 Minute Cap on this workout. Consider scaling the volume back depending on your capacity. 10-20-30-40 Reps for time is an acceptable alternative, for example. Make every rep perfect. Read: Thoughts On Scaling Pull-Ups in “Barabara” Post time and Rx to comments. compare t"
        },
        {
          "date": "2012-02-15",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/02/15/2012215barbara-html.html/",
          "summary": "Workout: 5 Rounds for time of: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Squats Rest precisely 3 minutes between each round. Post total time, work intervals and Rx to comments. Compare to 2.26.11 Difference Maker: Alex T decided that it was too hard to locate different weight bells given their random sizes and color patterns so he did something about it. Last Saturday he stayed after classes and stenc"
        },
        {
          "date": "2011-02-27",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/02/27/2011226barbara-html.html/",
          "summary": "Workout: 5 Rounds for time of: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Squats Rest precisely 3 minutes between each round. Post total time, work intervals and Rx to comments. compare to 7.1.10"
        },
        {
          "date": "2010-08-01",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/08/01/201081barbara-html.html/",
          "summary": "Workout: 5 Rounds for time of: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Squats Rest precisely 3 minutes between each round. Post total time, work intervals and Rx to comments. compare to 12.2.09 The Subway Series weightlifting participants SBK got 1st place overall in the event, here's how our athletes did: Name (Place overall) Best Snatch/Best Clean and Jerk Brian D (1st) 210/265 Yoon S (2nd) 185/22"
        },
        {
          "date": "2009-12-02",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/12/02/2009122barbara-html.html/",
          "summary": "Workout: 5 Rounds for time of: 20 Pull-Ups 30 Push-Ups 40 Sit-ups 50 Squats Rest precisely 3 minutes between each round. Post times for each round to comments. compare to 7.6.09 Accessory Work Foam Roll Cloyde works Muscle Ups The Hoboken Winter Challenge is just 11 Days away! Who all is representing CFSBK?"
        },
        {
          "date": "2009-03-07",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/03/07/200937barbara-html.html/",
          "summary": "Workout: 5 Rounds for time of: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Squats Rest precisely 3 minutes between each round. Post times to comments. compare to 6.14.08 Accessory Work Dynamic Mobility Barbell warm-ups before \"Grace\" A comprehensive warm-up is an essential component of any workout session. At SBK we spend anywhere from 12-15 minutes at the beginning of each class warming up, prepping th"
        },
        {
          "date": "2008-06-14",
          "title": "&#8220;Barbara&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/06/14/2008614barbara-html.html/",
          "summary": "Workout: 5 Rounds for Time of: 20 Pull-Ups 30 Push-Ups 40 Sit-Ups 50 Squats 3 Minute Rest Post rounds to comments Been a long time coming. \"Firefighter Fight Gone Bad\""
        }
      ]
    },
    {
      "name": "Angie",
      "count": 7,
      "latest_date": "2014-07-21",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/07/21/2014721angie-html.html/",
      "occurrences": [
        {
          "date": "2014-07-21",
          "title": "&#8220;Angie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/07/21/2014721angie-html.html/",
          "summary": "“Angie”: For Time: 100 Pull Ups 100 Push Ups 100 Sit Ups 100 Squats Post time and Rx to comments. Strength Cyclers in their post-Total glory | News and Notes: Coaches David, MeLo, Noah, and the Foxes are heading to California this week to watch the 2014 CrossFit Games . Catch all the Games’ action on ESPN starting Friday from 6-7pm PT, Saturday 5-7pm PT, and Sunday on ESPN2 from 5-6pm PT. Serious "
        },
        {
          "date": "2012-10-06",
          "title": "Tabata &#8220;Angie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/10/06/2012106tabata-angie-html.html/",
          "summary": "Workout: Working in invtervals of :20 work/:10 Rest, complete the following work: 100 Kipping Pull-Ups 100 Push-Ups 100 Sit-Ups 100 Squats -If you havent got kipping pull-ups, or they’re not developed well enough to complete 100 in a reasonable time, scale to 50 Kipping Pull-Ups, 35 Strict Pull-Ups or 50 Ring Rows. – Push-Ups can be scaled to 75 or 50, depending on capacity. Post total time and Rx"
        },
        {
          "date": "2011-10-16",
          "title": "Angie",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/10/16/20111016angie-html.html/",
          "summary": "Workout: For Time: 100 Pull-ups 100 Push-ups 100 Sit-ups 100 Squats Post time and Rx to comments Compare to 11.6.10 This is the start of Crush Week! Nino D. during FGB Congratulations to Gabrus on his wedding this weekend!!"
        },
        {
          "date": "2010-11-07",
          "title": "&#8220;Angie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/11/07/2010117angie-html.html/",
          "summary": "Workout: For Time: 100 Pull-Ups 100 Push-Ups 100 Sit-Ups 100 Squats Post time and Rx to comments. compare to 9.19.09 or \"Half Angie\" 3.3.10 Juliana's HSPU's Bon voyage to Coach Margie who left for Safari in Africa! Margie will be back in about a month, stay tuned for updates from her adventure, including working as a commentator in a power lifting meet. Coaches Shane and Jeremy are away this weeke"
        },
        {
          "date": "2010-03-03",
          "title": "Half &#8220;Angie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/03/03/201033half-angie-html.html/",
          "summary": "Workout: For Time: 50 Pull-ups 50 Push-Ups 50 Sit-Ups 50 Squats Post time and Rx to comments. suggested back-off week Skill Work Push Jerk review and practice \"Who wants to fight Shawn?\" Here are some insights into yesterday's Rest Day question from the September 2003 free issue of The CrossFit Journal . If you like this article and one's like it, check out the thick green binder in the library. I"
        },
        {
          "date": "2009-09-19",
          "title": "&#8220;Angie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/09/19/2009919angie-html.html/",
          "summary": "Workout: For Time: 100 Pull-ups 100 Push-ups 100 Sit-ups 100 Squats Post time to comments. compare to 3.1.08 Accessory Work Foam Roll Felix doing a barbell complex CFSBK at $14,570 for Fight Gone Bad To date, CrossFit South Brooklyn has raised $14,570 for charity, more than double what we raised last year! I'd like to especially acknowledge Matt Ufford who has raised $6,671 through the Kissing Suz"
        },
        {
          "date": "2008-03-01",
          "title": "&#8220;Angie&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/03/01/200831angie-html.html/",
          "summary": "Workout: For time: 100 Pull-ups 100 Push-ups 100 Sit-ups 100 Squats Afterwards we discussed the mechanisms behind the anterior pelvic tilt and did some PNF to demonstrate one way to help increase our squatting range of motion. Franklin keeps count for Al. Proprioceptive Neuromuscular Facilitation (PNF) It’s always best to start at the beginning."
        }
      ]
    },
    {
      "name": "Lynne",
      "count": 7,
      "latest_date": "2012-09-02",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/09/02/201292lynne-html.html/",
      "occurrences": [
        {
          "date": "2012-09-02",
          "title": "&#8220;Lynne&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/09/02/201292lynne-html.html/",
          "summary": "Workout: Fitness 5 Rounds not for time of: 10 Reps, Bench Press 12 Ring Rows or 5-10 Strict Pull-Ups ______________ Performance 5 Rounds not for time of: Max Bodyweight Bench Press Max Pull-ups Rest as needed between sets. We suggest 3-5 minutes depending on fatigue. Post reps per round and loads to comments. compare to 4.9.11 Strength Cycle Takes To The Wall Remember we are Closed Tomorrow for La"
        },
        {
          "date": "2011-04-10",
          "title": "&#8220;Lynne&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/04/10/2011410lynne-html.html/",
          "summary": "Workout: 5 Rounds not for time of: Max Bodyweight Bench Press Max Pull-ups Rest as needed between sets. We suggest 3-5 minutes depending on fatigue. Post reps per round and Rx to comments. compare to 5.2.09 and 6.13.10 WOD Demo CrossFit Coach Laurel's Overhead Squat Happy Birthday, Dan H3 and Erica N ! To celebrate, Erica popped off 6x5x175 back squats this week, that's bodyweight x30! Bon Voyage "
        },
        {
          "date": "2010-06-13",
          "title": "Ca&#8217;lynne&#8217;sthenic",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/06/13/2010613calynnesthenic-html.html/",
          "summary": "Workout: 5 Rounds for max reps of: Push-ups Pull-ups There is no time component to this WOD. Have you ever tried \"Lynne\" with strict pull-ups? How about ring push-ups or dips instead of push-ups? Post reps per round and style to comments. compare to 1.03.10 Remember how cold it was the last time we did this?! Tomorrow starts the beginning of new strength cycle! Monday-Power Snatch Wednesday-Front "
        },
        {
          "date": "2010-01-03",
          "title": "Ca&#8221;lynne&#8221;sthenic",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/01/03/201013calynnesthenic-html.html/",
          "summary": "Workout: 5 Rounds for max reps of: Push-ups Pull-ups There is no time component to this WOD. Have you ever tried \"Lynne\" with strict pull-ups? How about ring push-ups or dips instead of push-ups? Post reps per round and style to comments. compare to 5.02.09 Shree warms up on the Erg Today's classes are at 10am, 11am and 12pm The CRASH B's are fast approaching. Remember that Coach Nick has provided"
        },
        {
          "date": "2009-05-02",
          "title": "&#8220;Lynne&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/05/02/200952lynne-html.html/",
          "summary": "Workout: 5 Rounds for max reps of Bodyweight bench press (e.g., same amount on bar as you weigh) Pull-ups There is no time component to this WOD. Have you ever tried \"Lynne\" with strict pull-ups? How about ring push-ups or dips instead of bench press? Experiment with your WOD. Post reps to comments. compare to 2.18.09 Accessory Work Rotator Cuff Circuit 2 Malcolm eats Power Cleans for breakfast. C"
        },
        {
          "date": "2009-02-18",
          "title": "&#8220;Lynne&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/02/18/2009218lynne-html.html/",
          "summary": "Workout: 5 Rounds for max reps of Bodyweight bench press (e.g., same amount on bar as you weigh) Pull-ups There is no time component to this WOD. Post reps to comments. compare to 11.26.08 Steph is ready for her close-up Happy Birthday, Bethany!! CrossFit Staten Island"
        },
        {
          "date": "2008-11-26",
          "title": "&#8220;Lynne&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/11/26/20081126lynne-html.html/",
          "summary": "Workout: 5 Rounds for max reps of Bodyweight bench press (e.g., same amount on bar as you weigh) Pull-ups There is no time component to this WOD. Post reps to comments. compare to 9.1.08 CrossFit rarely asks for maxes. This workout does and expects that there is no “gaming” the workout. At Brand X I tell people I want to see you falling off the pull up bar. People whose score looks like 10/30 8/25"
        }
      ]
    },
    {
      "name": "Nancy",
      "count": 7,
      "latest_date": "2017-07-02",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/07/02/crush-week-nancy-2.html/",
      "occurrences": [
        {
          "date": "2017-07-02",
          "title": "Crush Week: &#8220;Nancy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/07/02/crush-week-nancy-2.html/",
          "summary": "“Nancy”: 5 Rounds for Time: 400m Run 15 Overhead Squats 95/65 Post time and Rx to comments. Compare with 4.20.17 | Register Now for the Active Life Bulletproof Workshop at CFSBK!: Where: 608 Degraw When: Sunday, July 16th from 2-7pm. A 20 minute snack break will be included. Who: Hosted by Coach KHarpZ and other members of the Active Life staff What : At a Bulletproof Workshop , Active Life doctor"
        },
        {
          "date": "2017-04-20",
          "title": "Crush Week: &#8220;Nancy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2017/04/20/crush-week-nancy.html/",
          "summary": "“Nancy”: 5 Rounds for Time: 400m Run 15 OHS 95/65 Post time and Rx to comments. Compare with 6.12.16 A post shared by CrossFit South Brooklyn (@crossfitsouthbrooklyn) on Apr 12, 2017 at 11:29am PDT From our Instagram account : “CFSBK babies sneaking in some Push-Ups and Hollow Rocks while moms get after it in our Diapers & Dumbbells class. Every MWF at 11am.” | Diapers & Dumbbells: Lift, Laugh, Le"
        },
        {
          "date": "2016-06-12",
          "title": "&#8220;Nancy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/06/12/2016612nancy-html.html/",
          "summary": "Overhead Squat: Take 10 Minutes to warm up to work weight for the WOD. Practice: Power Snatch + Overhead Squat and Clean and Jerk + Overhead Squat __________________ | “Nancy”: 5 Rounds For Time: 400 Meter Run 15 Overhead Squats 95/65lbs Post time and Rx to comments. Our CrossFit Kids classes love to climb the rope under the watchful eye of Sensei David | Farewell, Rytas S.!: Dedicated CFSBKer Ryt"
        },
        {
          "date": "2014-07-26",
          "title": "&#8220;Nancy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2014/07/26/2014726nancy-html.html/",
          "summary": "“Nancy”: 5 Rounds for time: 400m Run 15 Overhead Squat 95/65 Post rounds and Rx to comments. | Schedule Changes: Please make note of the following schedule changes: Saturday 7/26 (TODAY): Active Recovery is canceled Sunday 7/27: Active Recovery and the Teaser class are canceled Saturday 8/2: Active Recovery is canceled Yoga for Athletes is on today at 10am , and there are still some spaces in Ken’"
        },
        {
          "date": "2012-12-27",
          "title": "Rowing Interval &#8220;Nancy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/12/27/20121227rowing-interval-nancy-html.html/",
          "summary": "Workout: Perform 5 Rounds For Time of: 400m Row 15 Overhead Squats 95/65 Work with a partner alternating each round until you both complete 5 rounds. Post total time, Rx and partner to comments. Laura M feels the power of the Dumbbell"
        },
        {
          "date": "2010-04-04",
          "title": "&#8220;Nancy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/04/04/201044nancy-html.html/",
          "summary": "Workout: 5 rounds for time of: Run 400m 15 Overhead Squats 95/65 Post time and Rx to comments. compare to 9.6.09 suggested back-off Ari goes 2 pood on the Swing/Run intervals Great work to the three athletes who tried out for the affiliate team this weekend, here are their results. WOD 1: Max Clean and Jerk, 3 attempts Ryan P 195 Sameer P 135 Jess F 105 WOD 2: 21-15-9 Deadlifts (225/155) and Pull-"
        },
        {
          "date": "2009-09-06",
          "title": "&#8220;Nancy&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/09/06/200996nancy-html.html/",
          "summary": "Workout: 5 Rounds For Time of: 400m Run 15 Overhead Squats, 95lbs Post time to comments. Accessory Work Foam Roll Charlotte and Linus _____________________ Warm-up By Dutch Lowy \"SNancy\" by Megan CrossFit"
        }
      ]
    },
    {
      "name": "Elizabeth",
      "count": 6,
      "latest_date": "2016-06-06",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/06/06/201666crush-week-clean-elizabeth-html.html/",
      "occurrences": [
        {
          "date": "2016-06-06",
          "title": "Crush Week: Clean | &#8220;Elizabeth&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/06/06/201666crush-week-clean-elizabeth-html.html/",
          "summary": "Clean: Spend 10 minutes warming up your Clean and Dips/Push-Ups for the metcon. __________________ | “Elizabeth”: 21-15-9 Reps for Time: Cleans 135/95 Ring Dips The Cleans are Rx’d as full (squat) cleans. If you struggle with these, then consider scaling to “Power Elizabeth” (Power Cleans). This is generally a Ring-Dip workout for most people, so scale volume as necessary or scale the movement to "
        },
        {
          "date": "2011-10-13",
          "title": "Elizabeth",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/10/13/20111013elizabeth-html.html/",
          "summary": "Workout: 21-15-9 reps for time of: Clean 135/95 Ring Dips -Rx’d Elizabeth is a full squat clean. Athletes may also consider doing “Power Elizabeth” which would be any version above parallel clean. -Banded Ring Dips and Push Ups are subs for the Ring Dips. Athletes may use parelletes or dumbbells to increase ROM on the push up if desired.﻿ Post times and RX to comments. Compare to 12.14.10 and 6.20"
        },
        {
          "date": "2010-12-15",
          "title": "&#8220;Power Elizabeth&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/12/15/20101215power-elizabeth-html.html/",
          "summary": "Workout: 21-15-9 Reps for time of: Power Cleans 135/95 Ring Dips OR \"Musclebeth\" 9-6-3 Reps for time of: Power Clean 185/135 Muscle Ups Post version, time and Rx to comments. Compare 6.20.10 \"Elizabeth\" Demo CrossFit \"Power Elizabeth\" Demo CrossFit Overhead squats are the squat variant for the next month of programming. Here, Coach Laurel demos some overhead squats under fatigue. Today is the accu"
        },
        {
          "date": "2010-06-20",
          "title": "&#8220;Elizabeth&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/06/20/2010620elizabeth-html.html/",
          "summary": "Workout: 21-15-9 reps for time of: Clean 135/95 Ring Dips Athletes may choose whether to do the power clean or squat clean version of this benchmark WOD. Post time and Rx to comments. compare to 1.29.09 Nate does his first exposure of presses June's second Foundations cycle details: Days: Tuesdays and Thursdays at 8pm Dates: 6/29-7/22 Register Here! Happy Father's Day!! Do you think doing CrossFit"
        },
        {
          "date": "2009-01-29",
          "title": "&#8220;Elizabeth&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/01/29/2009129elizabeth-html.html/",
          "summary": "Workout: 21-15-9 reps of: Clean 135 pounds Ring dips Post time to comments. compare to 10.26.08 Accessory Work Spinal Flossing Hip Stretches Sameer Hooverball Party! Classes are off! Hooverball is on! (and maybe some CrossFit Dodgeball too) This Saturday, we are scrapping our regularly scheduled program for a little fun and games, CrossFit style. Come throw heavy balls around, eat paleo snacks and"
        },
        {
          "date": "2008-10-26",
          "title": "&#8220;Elizabeth&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/10/26/20081026elizabeth-html.html/",
          "summary": "Workout: 21-15-9 reps of: Clean 135 pounds Ring dips Post time to comments. Accessory work L-Sit Max Hold, Rest 2 Minutes, x3 500m Technique Row x2 or 8 Minutes Jump Rope Practice Lavall displays proper lifting mechanics even at significantly sub maximal loads. Don't get lazy when setting up for kettlebell swings! Quote of the week: \"As far as training partners go, if you run with the lame, you wi"
        }
      ]
    },
    {
      "name": "Isabel",
      "count": 6,
      "latest_date": "2025-08-18",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/08/17/monday-8-18-25.html/",
      "occurrences": [
        {
          "date": "2025-08-18",
          "title": "Monday 8.18.25",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2025/08/17/monday-8-18-25.html/",
          "summary": "“Running Isabel”: 5 rounds for time of: 130m Run 6 Snatches (155/105) Notes This workout was inspired by the CrossFit Games event “Running Isabel” which consists of five rounds of a couplet of running and snatches. The games featured a shorter 200 foot run, which meant for an exciting, very fast event (sub 3 minutes!). Today’s variation will allow for a bit more “recovery” between each round of sn"
        },
        {
          "date": "2016-12-15",
          "title": "Crush Week: &#8220;Isabel&#8221; and &#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/15/crush-week-isabel-and-grace.html/",
          "summary": "“Isabel”: For Time: 30 Snatches 135/95 Start at 0:00. 7 minute cap. Post time and Rx to comments. Compare with 6.7.15 _____________________ | “Grace”: For Time: 30 Clean and Jerks 135/95 Start at 20:00. 7 minute cap. Post time and Rx to comments. Compare with 10.13.16 Our friends at Spartan Race are gearing up for the 2017 season and want you to know that they’re offering three different season pa"
        },
        {
          "date": "2016-12-15",
          "title": "Crush Week: &#8220;Isabel&#8221; and &#8220;Grace&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/12/15/crush-week-isabel-and-grace-2.html/",
          "summary": "“Isabel”: For Time: 30 Snatches 135/95 Start at 0:00. 7 minute cap. Post time and Rx to comments. Compare with 6.7.15 _____________________ | “Grace”: For Time: 30 Clean and Jerks 135/95 Start at 20:00. 7 minute cap. Post time and Rx to comments. Compare with 10.13.16 Our friends at Spartan Race are gearing up for the 2017 season and want you to know that they’re offering three different season pa"
        },
        {
          "date": "2015-06-07",
          "title": "Power Snatch | &#8220;Isabel&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/06/07/201567power-snatch-isabel-html.html/",
          "summary": "Workout: Power Snatch: 1-1-1-1-1 Work up to a heavy single. Post loads to comments. _____________________"
        },
        {
          "date": "2015-01-18",
          "title": "&#8220;Isabel&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/01/18/2015118isabel-html.html/",
          "summary": "“Isabel”: For Time: 30 Snatches 135/95 Post time and Rx to comments. Compare to 11.30.2013 . Lauren B. holding strong at the bottom of her snatch at the last Oly Program Total Happy birthday, Front Desk superstar Lindsay S. ! (Read her Behind the Desk from last year here .) | Tomorrow Is Your Deadline to RSVP to CFSBK: Starting tomorrow, CFSBK will require our members to preregister online before "
        },
        {
          "date": "2010-11-06",
          "title": "6 Minute &#8220;Isabel&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/11/06/20101166-minute-isabel-html.html/",
          "summary": "Workout: 30 Snatches for time The competiton loads for \"Isabel\" are 135lbs for men and 95lbs for women. Attempt find the most weight you can Snatch for 30 reps in under 6 minutes. The goal is to scale this workout so that you can achieve the metabolic stimulus of a short, intense workout. Your scale will depend on how much you can lift and how techincallly sound your Snatch is. There is a hard cut"
        }
      ]
    },
    {
      "name": "Christine",
      "count": 4,
      "latest_date": "2022-07-10",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2022/07/09/sunday-7-10-22.html/",
      "occurrences": [
        {
          "date": "2022-07-10",
          "title": "Sunday 7.10.22",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2022/07/09/sunday-7-10-22.html/",
          "summary": "STRENGTH: A1) Single Leg Barbell Romanian Deadlift 3 x 6-8 ea side @ 2011 Notes: “Head to heel, strong as steel!” This exercise will challenge your coordination and balance. If you find you cannot stabilize an empty bar well through this movement as shown in the demo video, then perform a split stance variation instead. A2) Ring Plank 3 x 20-40 sec Notes: Perform this plank as shown in video: in a"
        },
        {
          "date": "2010-07-29",
          "title": "&#8220;Christine&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2010/07/29/2010729christine-html.html/",
          "summary": "Workout: 3 Rounds for time: Row 500m 12 Deadlifts, Bodyweight 21 Box Jumps, 24\"/20\" Post loads to comments. compare to 10.31.09 Ring Rows 5×5 3-2-3 Tempo Jack Sets up his Squat Remember that On Ramp class is tonight at 8pm and open to all members. Take a stroll down memory lane with SBK! Fight Gone Bad 3 Photo set ($ 7,303 Raised) Fight Gone Bad 4 Photo set ( $26,826 Raised) Will you be a part of "
        },
        {
          "date": "2009-10-31",
          "title": "&#8220;Christine&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/10/31/20091031christine-html.html/",
          "summary": "Workout: 3 Rounds For Time of: Row 500m 12 Deadlifts, Bodyweight 21 Box Jumps Post time and loads to comments. Accessory Work Handstand Review + Practice Steph P demos the OHS at her Level 1 Cert Tomorrow is the NYC Marathon and 4th Ave may be hard or impossible to transverse. If you're coming from the west side of 4th ave, plan on taking a little longer to get to the box. You may need to cross th"
        },
        {
          "date": "2009-07-10",
          "title": "Christine (FGB Style)",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/07/10/2009710christine-fgb-style-html.html/",
          "summary": "Workout: In this version of Christine, athletes will work in teams of 3. Athletes will go for max reps in 1 minute at each station. After the completion of all three stations there will be 1 minute of rest. This cycle will repeated for a total of 3 rounds. The stations are: 1. Row (for calories) 2. Deadlift (135#/65#) 3. Box Jumps Post individual & team reps to comments. Accessory Work: When was t"
        }
      ]
    },
    {
      "name": "Karen",
      "count": 3,
      "latest_date": "2016-10-12",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/10/12/20161012crush-week-rack-thruster-karen-html.html/",
      "occurrences": [
        {
          "date": "2016-10-12",
          "title": "Crush Week: Rack Thruster | &#8220;Karen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/10/12/20161012crush-week-rack-thruster-karen-html.html/",
          "summary": "Rack Thruster: 1-1-1-1-1 Work up to a 1RM Thruster taken out of a rack. Take the bar out strong and maintain a strong rack position through the drive. Any re-bend of the knee is missed rep. Post loads to comments. _____________________ | “Karen”: For Time: 150 Wall Ball 20/10, 14/9 Settle in and embrace it. Do your best to keep your feet in the same place to help with accuracy. Cycling your arms b"
        },
        {
          "date": "2016-08-14",
          "title": "Crush Week: Rack Thruster | &#8220;Karen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/08/14/2016814crush-week-rack-thruster-karen-html.html/",
          "summary": "Rack Thruster: 1-1-1-1-1 Work up to a 1RM Thruster taken out of a rack. Take the bar out strong and maintain a strong rack position through the drive. Any re-bend of the knee is missed rep. Post loads to commments. _____________________ | “Karen”: For Time: 150 Wall Balls 20/10, 14/9 Settle in and embrace it. Post time and Rx to comments. Coach Nick writes, “Greetings from Missoula! Our friend own"
        },
        {
          "date": "2008-08-07",
          "title": "&#8220;Karen&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/08/07/200887karen-html.html/",
          "summary": "Workout: For time: 150 Wallball Shots, 20/14 lb ball Post time to comments. Accessory work: Press 80%x5x3 Barbell reverse lunges with FSQ rack, 3x8e Karolina Our Fight Gone Bad team is now 5 strong! Juliana and Jeremy are our newest additions. Heaviest Man approaching weight loss record on ZONE DIET. Who has signed up for the Nutrition Seminar so far?"
        }
      ]
    },
    {
      "name": "Amanda",
      "count": 2,
      "latest_date": "2016-02-04",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/02/04/201624snatch-amanda-html.html/",
      "occurrences": [
        {
          "date": "2016-02-04",
          "title": "Snatch | &#8220;Amanda&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2016/02/04/201624snatch-amanda-html.html/",
          "summary": "Snatch: Every 2 Minutes for 14 Minutes (8 reps): 1 Snatch Start at about 70-80% and build to a max for the day. Press outs are no reps. Be sure to hit reps cleanly and balanced before adding weight. Post loads to comments. ____________________ Performance | “Amanda”: For Time: 9-7-5 Muscle-Ups Snatches 135/95 Rx for the snatch is a full squat. If it’s caught high there should not be a discernible "
        },
        {
          "date": "2015-10-21",
          "title": "Back Squat | &#8220;Amanda&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2015/10/21/20151021back-squat-amanda-html.html/",
          "summary": "Back Squat: Performance : Medium Intensity, 75-80% x 5 x 4 Fitness : 3 x 8 Linear Progression Heavier than last week. Exposure 2/8 Post loads to comments. _____________________ Performance | “Amanda”: 9-7-5 Reps for Time: Muscle-Ups Snatches 135/95 Rx for the snatch is a full squat. If it’s caught high there cannot be a discernible pause before riding to the bottom of a squat. Scaling to power sna"
        }
      ]
    },
    {
      "name": "Kelly",
      "count": 2,
      "latest_date": "2012-08-18",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/08/18/2012818kelly-html.html/",
      "occurrences": [
        {
          "date": "2012-08-18",
          "title": "&#8220;Kelly&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/08/18/2012818kelly-html.html/",
          "summary": "Workout: 5 Rounds for time of: Run 400m 30 Box Jumps, 24″/20″ (Mandatory Step Down) 30 Wall Ball Shots, 20/14 10′ or 9′ Target There is a 25 minute cap on today’s workout. “Kelly” is a high volume, long duration conditioning workout. Given the large number of Box Jumps coupled with running, we’re asking everyone to step down from their boxes instead of jumping down. This will protect your lower le"
        },
        {
          "date": "2009-02-01",
          "title": "Modified &#8220;Kelly&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2009/02/01/200921modified-kelly-html.html/",
          "summary": "Workout: 4 Rounds for time of: 30 Box Jumps, 24\" 30 Wall Ball Shots 20/14 Post time to comments. Accessory Work Deadlift Therapy Hoover Ball! \"Kelly\" CrossFit.com Greg and Annie do \"Fran\" CrossFit.com"
        }
      ]
    },
    {
      "name": "Mary",
      "count": 2,
      "latest_date": "2012-01-08",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/01/08/201218cindy-or-mary-html.html/",
      "occurrences": [
        {
          "date": "2012-01-08",
          "title": "&#8220;Cindy&#8221; or &#8220;Mary&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2012/01/08/201218cindy-or-mary-html.html/",
          "summary": "“Mary” AMRAP 20 minutes 5 Handstand Push-ups 10 One legged squats, alternating 15 Pull-ups: Post workout, rounds completed and Rx to comments. compare to 1.29.11 “Cindy… Or Mary??” … “YOU DECIDE” | Rest Day Dinner #2: Overview: Attention all Bed Stuy/Clinton Hill (and beyond!) CrossFitters. Melissa Lloyd is hosting the second Rest Day Dinner of the 2012 Paleo Challenge in your hood. This will be a"
        },
        {
          "date": "2008-12-21",
          "title": "&#8220;Cindy&#8221; or &#8220;Mary&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/12/21/20081221cindy-or-mary-html.html/",
          "summary": "Workout: \" Cindy \" Complete as many rounds in 20 minutes as you can of: 5 Pull-ups 10 Push-ups 15 Squats \" Mary \" Complete as many rounds in 20 minutes as you can of: 5 Handstand Push-ups 10 One legged squats, alternating 15 Pull-ups Post your choice of girls and rounds completed to comments. Compare \"Cindy\" to 9.10.08 Accessory work Handstand Progressions Willkommen zurück, Andy!! A solid DB rack"
        }
      ]
    },
    {
      "name": "Chelsea",
      "count": 1,
      "latest_date": "2011-03-27",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/03/27/2011327chelsea-html.html/",
      "occurrences": [
        {
          "date": "2011-03-27",
          "title": "&#8220;Chelsea&#8221;",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2011/03/27/2011327chelsea-html.html/",
          "summary": "Workout: Set up before a clock, and every minute on the minute perform 5 pull-ups, 10 push-ups, and 15 squats. Can you continue for thirty minutes? Twenty minutes? How about 10? Post results to comments. If you fall behind the clock keep going for thirty minutes and see how many rounds you can complete. If you've finished the workout before this time add +1 to each exercise, i.e., 6 pull-ups, 11 p"
        }
      ]
    },
    {
      "name": "Hope",
      "count": 1,
      "latest_date": "2022-05-07",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2022/05/06/saturday-5-7-22-hope-for-refugees.html/",
      "occurrences": [
        {
          "date": "2022-05-07",
          "title": "Saturday 5.7.22 Hope for Refugees",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2022/05/06/saturday-5-7-22-hope-for-refugees.html/",
          "summary": "HOPE FOR REFUGEES: 3 rounds of: Shuttle runs, 8 m Dumbbell snatches Bike for calories Dumbbell box step-ups Strict burpees Notes This workout has the same format as Fight Gone Bad, working at each station for one minute then rotating. After completing all 5 stations, rest for 1 minute before starting the next round. One point is given for each rep, calorie biked, or shuttle run length. ♀ 35-lb DB,"
        }
      ]
    },
    {
      "name": "Linda",
      "count": 1,
      "latest_date": "2008-04-20",
      "latest_link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/04/20/2008420linda-kinda-sorta-html.html/",
      "occurrences": [
        {
          "date": "2008-04-20",
          "title": "Linda (Kinda, Sorta)",
          "link": "https://crossfitsouthbrooklyn.com/workout-of-the-day/2008/04/20/2008420linda-kinda-sorta-html.html/",
          "summary": "Workout: 10-9-8…1 Reps of : 1.5x Body Weight Deadlift Dumbbell Squat Cleans L-Pull-Ups Post time and loads to comments. Sal Today’s Class (Sans Cleiser and Allen who had to leave early) Good Times What Sweetner Should you Choose"
        }
      ]
    }
  ]
}